Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_SCSR : (PMC Offset: 0x08) ( R/ 32) System Clock Status Register -------- */
#define PMC_SCSR_PCK0_Pos                     _U_(8)                                               /**< (PMC_SCSR) Programmable Clock 0 Output Status Position */
#define PMC_SCSR_PCK0_Msk                     (_U_(0x1) << PMC_SCSR_PCK0_Pos)                      /**< (PMC_SCSR) Programmable Clock 0 Output Status Mask */
#define PMC_SCSR_PCK0(value)                  (PMC_SCSR_PCK0_Msk & ((value) << PMC_SCSR_PCK0_Pos))
#define PMC_SCSR_PCK1_Pos                     _U_(9)                                               /**< (PMC_SCSR) Programmable Clock 1 Output Status Position */
#define PMC_SCSR_PCK1_Msk                     (_U_(0x1) << PMC_SCSR_PCK1_Pos)                      /**< (PMC_SCSR) Programmable Clock 1 Output Status Mask */
#define PMC_SCSR_PCK1(value)                  (PMC_SCSR_PCK1_Msk & ((value) << PMC_SCSR_PCK1_Pos))
#define PMC_SCSR_PCK2_Pos                     _U_(10)                                              /**< (PMC_SCSR) Programmable Clock 2 Output Status Position */
#define PMC_SCSR_PCK2_Msk                     (_U_(0x1) << PMC_SCSR_PCK2_Pos)                      /**< (PMC_SCSR) Programmable Clock 2 Output Status Mask */
#define PMC_SCSR_PCK2(value)                  (PMC_SCSR_PCK2_Msk & ((value) << PMC_SCSR_PCK2_Pos))
#define PMC_SCSR_PCK3_Pos                     _U_(11)                                              /**< (PMC_SCSR) Programmable Clock 3 Output Status Position */
#define PMC_SCSR_PCK3_Msk                     (_U_(0x1) << PMC_SCSR_PCK3_Pos)                      /**< (PMC_SCSR) Programmable Clock 3 Output Status Mask */
#define PMC_SCSR_PCK3(value)                  (PMC_SCSR_PCK3_Msk & ((value) << PMC_SCSR_PCK3_Pos))
#define PMC_SCSR_Msk                          _U_(0x00000F00)                                      /**< (PMC_SCSR) Register Mask  */

#define PMC_SCSR_PCK_Pos                      _U_(8)                                               /**< (PMC_SCSR Position) Programmable Clock 3 Output Status */
#define PMC_SCSR_PCK_Msk                      (_U_(0xF) << PMC_SCSR_PCK_Pos)                       /**< (PMC_SCSR Mask) PCK */
#define PMC_SCSR_PCK(value)                   (PMC_SCSR_PCK_Msk & ((value) << PMC_SCSR_PCK_Pos))   

/* -------- CKGR_MOR : (PMC Offset: 0x20) (R/W 32) Main Oscillator Register -------- */
#define CKGR_MOR_MOSCXTEN_Pos                 _U_(0)                                               /**< (CKGR_MOR) Main Crystal Oscillator Enable Position */
#define CKGR_MOR_MOSCXTEN_Msk                 (_U_(0x1) << CKGR_MOR_MOSCXTEN_Pos)                  /**< (CKGR_MOR) Main Crystal Oscillator Enable Mask */
#define CKGR_MOR_MOSCXTEN(value)              (CKGR_MOR_MOSCXTEN_Msk & ((value) << CKGR_MOR_MOSCXTEN_Pos))
#define CKGR_MOR_MOSCXTBY_Pos                 _U_(1)                                               /**< (CKGR_MOR) Main Crystal Oscillator Bypass Position */
#define CKGR_MOR_MOSCXTBY_Msk                 (_U_(0x1) << CKGR_MOR_MOSCXTBY_Pos)                  /**< (CKGR_MOR) Main Crystal Oscillator Bypass Mask */
#define CKGR_MOR_MOSCXTBY(value)              (CKGR_MOR_MOSCXTBY_Msk & ((value) << CKGR_MOR_MOSCXTBY_Pos))
#define CKGR_MOR_MOSCRCEN_Pos                 _U_(3)                                               /**< (CKGR_MOR) Main RC Oscillator Enable Position */
#define CKGR_MOR_MOSCRCEN_Msk                 (_U_(0x1) << CKGR_MOR_MOSCRCEN_Pos)                  /**< (CKGR_MOR) Main RC Oscillator Enable Mask */
#define CKGR_MOR_MOSCRCEN(value)              (CKGR_MOR_MOSCRCEN_Msk & ((value) << CKGR_MOR_MOSCRCEN_Pos))
#define CKGR_MOR_MOSCRCF_Pos                  _U_(4)                                               /**< (CKGR_MOR) Main RC Oscillator Frequency Selection Position */
#define CKGR_MOR_MOSCRCF_Msk                  (_U_(0x7) << CKGR_MOR_MOSCRCF_Pos)                   /**< (CKGR_MOR) Main RC Oscillator Frequency Selection Mask */
#define CKGR_MOR_MOSCRCF(value)               (CKGR_MOR_MOSCRCF_Msk & ((value) << CKGR_MOR_MOSCRCF_Pos))
#define   CKGR_MOR_MOSCRCF_4_MHZ_Val          _U_(0x0)                                             /**< (CKGR_MOR) The RC oscillator frequency is at 4 MHz  */
#define   CKGR_MOR_MOSCRCF_8_MHZ_Val          _U_(0x1)                                             /**< (CKGR_MOR) The RC oscillator frequency is at 8 MHz  */
#define   CKGR_MOR_MOSCRCF_10_MHZ_Val         _U_(0x2)                                             /**< (CKGR_MOR) The RC oscillator frequency is at 10 MHz  */
#define   CKGR_MOR_MOSCRCF_12_MHZ_Val         _U_(0x3)                                             /**< (CKGR_MOR) The RC oscillator frequency is at 12 MHz  */
#define CKGR_MOR_MOSCRCF_4_MHZ                (CKGR_MOR_MOSCRCF_4_MHZ_Val << CKGR_MOR_MOSCRCF_Pos) /**< (CKGR_MOR) The RC oscillator frequency is at 4 MHz Position  */
#define CKGR_MOR_MOSCRCF_8_MHZ                (CKGR_MOR_MOSCRCF_8_MHZ_Val << CKGR_MOR_MOSCRCF_Pos) /**< (CKGR_MOR) The RC oscillator frequency is at 8 MHz Position  */
#define CKGR_MOR_MOSCRCF_10_MHZ               (CKGR_MOR_MOSCRCF_10_MHZ_Val << CKGR_MOR_MOSCRCF_Pos) /**< (CKGR_MOR) The RC oscillator frequency is at 10 MHz Position  */
#define CKGR_MOR_MOSCRCF_12_MHZ               (CKGR_MOR_MOSCRCF_12_MHZ_Val << CKGR_MOR_MOSCRCF_Pos) /**< (CKGR_MOR) The RC oscillator frequency is at 12 MHz Position  */
#define CKGR_MOR_MOSCXTST_Pos                 _U_(8)                                               /**< (CKGR_MOR) Main Crystal Oscillator Startup Time Position */
#define CKGR_MOR_MOSCXTST_Msk                 (_U_(0xFF) << CKGR_MOR_MOSCXTST_Pos)                 /**< (CKGR_MOR) Main Crystal Oscillator Startup Time Mask */
#define CKGR_MOR_MOSCXTST(value)              (CKGR_MOR_MOSCXTST_Msk & ((value) << CKGR_MOR_MOSCXTST_Pos))
#define CKGR_MOR_KEY_Pos                      _U_(16)                                              /**< (CKGR_MOR) Write Access Password Position */
#define CKGR_MOR_KEY_Msk                      (_U_(0xFF) << CKGR_MOR_KEY_Pos)                      /**< (CKGR_MOR) Write Access Password Mask */
#define CKGR_MOR_KEY(value)                   (CKGR_MOR_KEY_Msk & ((value) << CKGR_MOR_KEY_Pos))  
#define   CKGR_MOR_KEY_PASSWD_Val             _U_(0x37)                                            /**< (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define CKGR_MOR_KEY_PASSWD                   (CKGR_MOR_KEY_PASSWD_Val << CKGR_MOR_KEY_Pos)        /**< (CKGR_MOR) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define CKGR_MOR_MOSCSEL_Pos                  _U_(24)                                              /**< (CKGR_MOR) Main Clock Oscillator Selection Position */
#define CKGR_MOR_MOSCSEL_Msk                  (_U_(0x1) << CKGR_MOR_MOSCSEL_Pos)                   /**< (CKGR_MOR) Main Clock Oscillator Selection Mask */
#define CKGR_MOR_MOSCSEL(value)               (CKGR_MOR_MOSCSEL_Msk & ((value) << CKGR_MOR_MOSCSEL_Pos))
#define CKGR_MOR_CFDEN_Pos                    _U_(25)                                              /**< (CKGR_MOR) Clock Failure Detector Enable Position */
#define CKGR_MOR_CFDEN_Msk                    (_U_(0x1) << CKGR_MOR_CFDEN_Pos)                     /**< (CKGR_MOR) Clock Failure Detector Enable Mask */
#define CKGR_MOR_CFDEN(value)                 (CKGR_MOR_CFDEN_Msk & ((value) << CKGR_MOR_CFDEN_Pos))
#define CKGR_MOR_XT32KFME_Pos                 _U_(26)                                              /**< (CKGR_MOR) 32.768 kHz Crystal Oscillator Frequency Monitoring Enable Position */
#define CKGR_MOR_XT32KFME_Msk                 (_U_(0x1) << CKGR_MOR_XT32KFME_Pos)                  /**< (CKGR_MOR) 32.768 kHz Crystal Oscillator Frequency Monitoring Enable Mask */
#define CKGR_MOR_XT32KFME(value)              (CKGR_MOR_XT32KFME_Msk & ((value) << CKGR_MOR_XT32KFME_Pos))
#define CKGR_MOR_BCPURST_Pos                  _U_(27)                                              /**< (CKGR_MOR) Bad CPU Clock Reset Enable Position */
#define CKGR_MOR_BCPURST_Msk                  (_U_(0x1) << CKGR_MOR_BCPURST_Pos)                   /**< (CKGR_MOR) Bad CPU Clock Reset Enable Mask */
#define CKGR_MOR_BCPURST(value)               (CKGR_MOR_BCPURST_Msk & ((value) << CKGR_MOR_BCPURST_Pos))
#define CKGR_MOR_BCPUNMIC_Pos                 _U_(28)                                              /**< (CKGR_MOR) Bad CPU Clock Interrupt to NMIC Enable Position */
#define CKGR_MOR_BCPUNMIC_Msk                 (_U_(0x1) << CKGR_MOR_BCPUNMIC_Pos)                  /**< (CKGR_MOR) Bad CPU Clock Interrupt to NMIC Enable Mask */
#define CKGR_MOR_BCPUNMIC(value)              (CKGR_MOR_BCPUNMIC_Msk & ((value) << CKGR_MOR_BCPUNMIC_Pos))
#define CKGR_MOR_Msk                          _U_(0x1FFFFF7B)                                      /**< (CKGR_MOR) Register Mask  */


/* -------- CKGR_MCFR : (PMC Offset: 0x24) (R/W 32) Main Clock Frequency Register -------- */
#define CKGR_MCFR_MAINF_Pos                   _U_(0)                                               /**< (CKGR_MCFR) Main Clock Frequency Position */
#define CKGR_MCFR_MAINF_Msk                   (_U_(0xFFFF) << CKGR_MCFR_MAINF_Pos)                 /**< (CKGR_MCFR) Main Clock Frequency Mask */
#define CKGR_MCFR_MAINF(value)                (CKGR_MCFR_MAINF_Msk & ((value) << CKGR_MCFR_MAINF_Pos))
#define CKGR_MCFR_MAINFRDY_Pos                _U_(16)                                              /**< (CKGR_MCFR) Main Clock Frequency Measure Ready Position */
#define CKGR_MCFR_MAINFRDY_Msk                (_U_(0x1) << CKGR_MCFR_MAINFRDY_Pos)                 /**< (CKGR_MCFR) Main Clock Frequency Measure Ready Mask */
#define CKGR_MCFR_MAINFRDY(value)             (CKGR_MCFR_MAINFRDY_Msk & ((value) << CKGR_MCFR_MAINFRDY_Pos))
#define CKGR_MCFR_RCMEAS_Pos                  _U_(20)                                              /**< (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Position */
#define CKGR_MCFR_RCMEAS_Msk                  (_U_(0x1) << CKGR_MCFR_RCMEAS_Pos)                   /**< (CKGR_MCFR) RC Oscillator Frequency Measure (write-only) Mask */
#define CKGR_MCFR_RCMEAS(value)               (CKGR_MCFR_RCMEAS_Msk & ((value) << CKGR_MCFR_RCMEAS_Pos))
#define CKGR_MCFR_CCSS_Pos                    _U_(24)                                              /**< (CKGR_MCFR) Counter Clock Source Selection Position */
#define CKGR_MCFR_CCSS_Msk                    (_U_(0x1) << CKGR_MCFR_CCSS_Pos)                     /**< (CKGR_MCFR) Counter Clock Source Selection Mask */
#define CKGR_MCFR_CCSS(value)                 (CKGR_MCFR_CCSS_Msk & ((value) << CKGR_MCFR_CCSS_Pos))
#define CKGR_MCFR_Msk                         _U_(0x0111FFFF)                                      /**< (CKGR_MCFR) Register Mask  */


/* -------- CKGR_PLLAR : (PMC Offset: 0x28) (R/W 32) PLLA Register -------- */
#define CKGR_PLLAR_DIVA_Pos                   _U_(0)                                               /**< (CKGR_PLLAR) PLLA Front End Divider Position */
#define CKGR_PLLAR_DIVA_Msk                   (_U_(0xFF) << CKGR_PLLAR_DIVA_Pos)                   /**< (CKGR_PLLAR) PLLA Front End Divider Mask */
#define CKGR_PLLAR_DIVA(value)                (CKGR_PLLAR_DIVA_Msk & ((value) << CKGR_PLLAR_DIVA_Pos))
#define   CKGR_PLLAR_DIVA_0_Val               _U_(0x0)                                             /**< (CKGR_PLLAR) PLLA is disabled.  */
#define   CKGR_PLLAR_DIVA_BYPASS_Val          _U_(0x1)                                             /**< (CKGR_PLLAR) Divider is bypassed (divide by 1) and PLLA is enabled.  */
#define CKGR_PLLAR_DIVA_0                     (CKGR_PLLAR_DIVA_0_Val << CKGR_PLLAR_DIVA_Pos)       /**< (CKGR_PLLAR) PLLA is disabled. Position  */
#define CKGR_PLLAR_DIVA_BYPASS                (CKGR_PLLAR_DIVA_BYPASS_Val << CKGR_PLLAR_DIVA_Pos)  /**< (CKGR_PLLAR) Divider is bypassed (divide by 1) and PLLA is enabled. Position  */
#define CKGR_PLLAR_PLLACOUNT_Pos              _U_(8)                                               /**< (CKGR_PLLAR) PLLA Counter Position */
#define CKGR_PLLAR_PLLACOUNT_Msk              (_U_(0x3F) << CKGR_PLLAR_PLLACOUNT_Pos)              /**< (CKGR_PLLAR) PLLA Counter Mask */
#define CKGR_PLLAR_PLLACOUNT(value)           (CKGR_PLLAR_PLLACOUNT_Msk & ((value) << CKGR_PLLAR_PLLACOUNT_Pos))
#define CKGR_PLLAR_FREQ_VCO_Pos               _U_(14)                                              /**< (CKGR_PLLAR) VCO Frequency Configuratio Position */
#define CKGR_PLLAR_FREQ_VCO_Msk               (_U_(0x3) << CKGR_PLLAR_FREQ_VCO_Pos)                /**< (CKGR_PLLAR) VCO Frequency Configuratio Mask */
#define CKGR_PLLAR_FREQ_VCO(value)            (CKGR_PLLAR_FREQ_VCO_Msk & ((value) << CKGR_PLLAR_FREQ_VCO_Pos))
#define   CKGR_PLLAR_FREQ_VCO_VCO0_Val        _U_(0x0)                                             /**< (CKGR_PLLAR) Frequency range: 40-80 MHz  */
#define   CKGR_PLLAR_FREQ_VCO_VCO1_Val        _U_(0x1)                                             /**< (CKGR_PLLAR) Frequency range: 70-150 MHz  */
#define   CKGR_PLLAR_FREQ_VCO_VCO2_Val        _U_(0x2)                                             /**< (CKGR_PLLAR) Frequency range: 125-275 MHz  */
#define   CKGR_PLLAR_FREQ_VCO_VCO3_Val        _U_(0x3)                                             /**< (CKGR_PLLAR) Frequency range: 250-450 MHz  */
#define CKGR_PLLAR_FREQ_VCO_VCO0              (CKGR_PLLAR_FREQ_VCO_VCO0_Val << CKGR_PLLAR_FREQ_VCO_Pos) /**< (CKGR_PLLAR) Frequency range: 40-80 MHz Position  */
#define CKGR_PLLAR_FREQ_VCO_VCO1              (CKGR_PLLAR_FREQ_VCO_VCO1_Val << CKGR_PLLAR_FREQ_VCO_Pos) /**< (CKGR_PLLAR) Frequency range: 70-150 MHz Position  */
#define CKGR_PLLAR_FREQ_VCO_VCO2              (CKGR_PLLAR_FREQ_VCO_VCO2_Val << CKGR_PLLAR_FREQ_VCO_Pos) /**< (CKGR_PLLAR) Frequency range: 125-275 MHz Position  */
#define CKGR_PLLAR_FREQ_VCO_VCO3              (CKGR_PLLAR_FREQ_VCO_VCO3_Val << CKGR_PLLAR_FREQ_VCO_Pos) /**< (CKGR_PLLAR) Frequency range: 250-450 MHz Position  */
#define CKGR_PLLAR_MULA_Pos                   _U_(16)                                              /**< (CKGR_PLLAR) PLLA Multiplier Position */
#define CKGR_PLLAR_MULA_Msk                   (_U_(0x7FF) << CKGR_PLLAR_MULA_Pos)                  /**< (CKGR_PLLAR) PLLA Multiplier Mask */
#define CKGR_PLLAR_MULA(value)                (CKGR_PLLAR_MULA_Msk & ((value) << CKGR_PLLAR_MULA_Pos))
#define CKGR_PLLAR_ONE_Pos                    _U_(29)                                              /**< (CKGR_PLLAR) Must Be Set to 1 Position */
#define CKGR_PLLAR_ONE_Msk                    (_U_(0x1) << CKGR_PLLAR_ONE_Pos)                     /**< (CKGR_PLLAR) Must Be Set to 1 Mask */
#define CKGR_PLLAR_ONE(value)                 (CKGR_PLLAR_ONE_Msk & ((value) << CKGR_PLLAR_ONE_Pos))
#define CKGR_PLLAR_Msk                        _U_(0x27FFFFFF)                                      /**< (CKGR_PLLAR) Register Mask  */


/* -------- CKGR_PLLBR : (PMC Offset: 0x2C) (R/W 32) PLLB Register -------- */
#define CKGR_PLLBR_DIVB_Pos                   _U_(0)                                               /**< (CKGR_PLLBR) PLLB Front End Divider Position */
#define CKGR_PLLBR_DIVB_Msk                   (_U_(0xFF) << CKGR_PLLBR_DIVB_Pos)                   /**< (CKGR_PLLBR) PLLB Front End Divider Mask */
#define CKGR_PLLBR_DIVB(value)                (CKGR_PLLBR_DIVB_Msk & ((value) << CKGR_PLLBR_DIVB_Pos))
#define   CKGR_PLLBR_DIVB_0_Val               _U_(0x0)                                             /**< (CKGR_PLLBR) PLLBis disabled.  */
#define   CKGR_PLLBR_DIVB_BYPASS_Val          _U_(0x1)                                             /**< (CKGR_PLLBR) Divider is bypassed (divide by 1) and PLLB is enabled.  */
#define CKGR_PLLBR_DIVB_0                     (CKGR_PLLBR_DIVB_0_Val << CKGR_PLLBR_DIVB_Pos)       /**< (CKGR_PLLBR) PLLBis disabled. Position  */
#define CKGR_PLLBR_DIVB_BYPASS                (CKGR_PLLBR_DIVB_BYPASS_Val << CKGR_PLLBR_DIVB_Pos)  /**< (CKGR_PLLBR) Divider is bypassed (divide by 1) and PLLB is enabled. Position  */
#define CKGR_PLLBR_PLLBCOUNT_Pos              _U_(8)                                               /**< (CKGR_PLLBR) PLLB Counter Position */
#define CKGR_PLLBR_PLLBCOUNT_Msk              (_U_(0x3F) << CKGR_PLLBR_PLLBCOUNT_Pos)              /**< (CKGR_PLLBR) PLLB Counter Mask */
#define CKGR_PLLBR_PLLBCOUNT(value)           (CKGR_PLLBR_PLLBCOUNT_Msk & ((value) << CKGR_PLLBR_PLLBCOUNT_Pos))
#define CKGR_PLLBR_FREQ_VCO_Pos               _U_(14)                                              /**< (CKGR_PLLBR) VCO Frequency Configuration Position */
#define CKGR_PLLBR_FREQ_VCO_Msk               (_U_(0x3) << CKGR_PLLBR_FREQ_VCO_Pos)                /**< (CKGR_PLLBR) VCO Frequency Configuration Mask */
#define CKGR_PLLBR_FREQ_VCO(value)            (CKGR_PLLBR_FREQ_VCO_Msk & ((value) << CKGR_PLLBR_FREQ_VCO_Pos))
#define   CKGR_PLLBR_FREQ_VCO_VCO0_Val        _U_(0x0)                                             /**< (CKGR_PLLBR) Frequency range: 40-80 MHz  */
#define   CKGR_PLLBR_FREQ_VCO_VCO1_Val        _U_(0x1)                                             /**< (CKGR_PLLBR) Frequency range: 70-150 MHz  */
#define   CKGR_PLLBR_FREQ_VCO_VCO2_Val        _U_(0x2)                                             /**< (CKGR_PLLBR) Frequency range: 125-275 MHz  */
#define   CKGR_PLLBR_FREQ_VCO_VCO3_Val        _U_(0x3)                                             /**< (CKGR_PLLBR) Frequency range: 250-450 MHz  */
#define CKGR_PLLBR_FREQ_VCO_VCO0              (CKGR_PLLBR_FREQ_VCO_VCO0_Val << CKGR_PLLBR_FREQ_VCO_Pos) /**< (CKGR_PLLBR) Frequency range: 40-80 MHz Position  */
#define CKGR_PLLBR_FREQ_VCO_VCO1              (CKGR_PLLBR_FREQ_VCO_VCO1_Val << CKGR_PLLBR_FREQ_VCO_Pos) /**< (CKGR_PLLBR) Frequency range: 70-150 MHz Position  */
#define CKGR_PLLBR_FREQ_VCO_VCO2              (CKGR_PLLBR_FREQ_VCO_VCO2_Val << CKGR_PLLBR_FREQ_VCO_Pos) /**< (CKGR_PLLBR) Frequency range: 125-275 MHz Position  */
#define CKGR_PLLBR_FREQ_VCO_VCO3              (CKGR_PLLBR_FREQ_VCO_VCO3_Val << CKGR_PLLBR_FREQ_VCO_Pos) /**< (CKGR_PLLBR) Frequency range: 250-450 MHz Position  */
#define CKGR_PLLBR_MULB_Pos                   _U_(16)                                              /**< (CKGR_PLLBR) PLLB Multiplier Position */
#define CKGR_PLLBR_MULB_Msk                   (_U_(0x7FF) << CKGR_PLLBR_MULB_Pos)                  /**< (CKGR_PLLBR) PLLB Multiplier Mask */
#define CKGR_PLLBR_MULB(value)                (CKGR_PLLBR_MULB_Msk & ((value) << CKGR_PLLBR_MULB_Pos))
#define CKGR_PLLBR_SRCB_Pos                   _U_(29)                                              /**< (CKGR_PLLBR) PLLB Source Clock Selection Position */
#define CKGR_PLLBR_SRCB_Msk                   (_U_(0x3) << CKGR_PLLBR_SRCB_Pos)                    /**< (CKGR_PLLBR) PLLB Source Clock Selection Mask */
#define CKGR_PLLBR_SRCB(value)                (CKGR_PLLBR_SRCB_Msk & ((value) << CKGR_PLLBR_SRCB_Pos))
#define   CKGR_PLLBR_SRCB_MAINCK_Val          _U_(0x0)                                             /**< (CKGR_PLLBR) MAINCK is the source clock of PLLB.  */
#define   CKGR_PLLBR_SRCB_RC2CK_Val           _U_(0x2)                                             /**< (CKGR_PLLBR) RC2CK is the source clock of PLLB.  */
#define CKGR_PLLBR_SRCB_MAINCK                (CKGR_PLLBR_SRCB_MAINCK_Val << CKGR_PLLBR_SRCB_Pos)  /**< (CKGR_PLLBR) MAINCK is the source clock of PLLB. Position  */
#define CKGR_PLLBR_SRCB_RC2CK                 (CKGR_PLLBR_SRCB_RC2CK_Val << CKGR_PLLBR_SRCB_Pos)   /**< (CKGR_PLLBR) RC2CK is the source clock of PLLB. Position  */
#define CKGR_PLLBR_Msk                        _U_(0x67FFFFFF)                                      /**< (CKGR_PLLBR) Register Mask  */


