Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_FOCR : (PMC Offset: 0x78) ( /W 32) Fault Output Clear Register -------- */
#define PMC_FOCR_FOCLR_Pos                    _U_(0)                                               /**< (PMC_FOCR) Fault Output Clear Position */
#define PMC_FOCR_FOCLR_Msk                    (_U_(0x1) << PMC_FOCR_FOCLR_Pos)                     /**< (PMC_FOCR) Fault Output Clear Mask */
#define PMC_FOCR_FOCLR(value)                 (PMC_FOCR_FOCLR_Msk & ((value) << PMC_FOCR_FOCLR_Pos))
#define PMC_FOCR_Msk                          _U_(0x00000001)                                      /**< (PMC_FOCR) Register Mask  */


/* -------- PMC_PLL_CFG : (PMC Offset: 0x80) (R/W 32) PLL Configuration Register -------- */
#define PMC_PLL_CFG_OUTCUR_PLLA_Pos           _U_(0)                                               /**< (PMC_PLL_CFG) PLLA Output Current Position */
#define PMC_PLL_CFG_OUTCUR_PLLA_Msk           (_U_(0xF) << PMC_PLL_CFG_OUTCUR_PLLA_Pos)            /**< (PMC_PLL_CFG) PLLA Output Current Mask */
#define PMC_PLL_CFG_OUTCUR_PLLA(value)        (PMC_PLL_CFG_OUTCUR_PLLA_Msk & ((value) << PMC_PLL_CFG_OUTCUR_PLLA_Pos))
#define   PMC_PLL_CFG_OUTCUR_PLLA_ICP0_Val    _U_(0x0)                                             /**< (PMC_PLL_CFG) 0.5 mA  */
#define   PMC_PLL_CFG_OUTCUR_PLLA_ICP1_Val    _U_(0x1)                                             /**< (PMC_PLL_CFG) 0.75 mA  */
#define   PMC_PLL_CFG_OUTCUR_PLLA_ICP2_Val    _U_(0x2)                                             /**< (PMC_PLL_CFG) 1 mA  */
#define   PMC_PLL_CFG_OUTCUR_PLLA_ICP3_Val    _U_(0x3)                                             /**< (PMC_PLL_CFG) 1.25 mA  */
#define PMC_PLL_CFG_OUTCUR_PLLA_ICP0          (PMC_PLL_CFG_OUTCUR_PLLA_ICP0_Val << PMC_PLL_CFG_OUTCUR_PLLA_Pos) /**< (PMC_PLL_CFG) 0.5 mA Position  */
#define PMC_PLL_CFG_OUTCUR_PLLA_ICP1          (PMC_PLL_CFG_OUTCUR_PLLA_ICP1_Val << PMC_PLL_CFG_OUTCUR_PLLA_Pos) /**< (PMC_PLL_CFG) 0.75 mA Position  */
#define PMC_PLL_CFG_OUTCUR_PLLA_ICP2          (PMC_PLL_CFG_OUTCUR_PLLA_ICP2_Val << PMC_PLL_CFG_OUTCUR_PLLA_Pos) /**< (PMC_PLL_CFG) 1 mA Position  */
#define PMC_PLL_CFG_OUTCUR_PLLA_ICP3          (PMC_PLL_CFG_OUTCUR_PLLA_ICP3_Val << PMC_PLL_CFG_OUTCUR_PLLA_Pos) /**< (PMC_PLL_CFG) 1.25 mA Position  */
#define PMC_PLL_CFG_SCA_Pos                   _U_(12)                                              /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Capaticance Value Position */
#define PMC_PLL_CFG_SCA_Msk                   (_U_(0x3) << PMC_PLL_CFG_SCA_Pos)                    /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Capaticance Value Mask */
#define PMC_PLL_CFG_SCA(value)                (PMC_PLL_CFG_SCA_Msk & ((value) << PMC_PLL_CFG_SCA_Pos))
#define   PMC_PLL_CFG_SCA_SC_VAL_20p_Val      _U_(0x0)                                             /**< (PMC_PLL_CFG) 20 pF  */
#define   PMC_PLL_CFG_SCA_SC_VAL_40p_Val      _U_(0x1)                                             /**< (PMC_PLL_CFG) 40 pF  */
#define   PMC_PLL_CFG_SCA_SC_VAL_30p_Val      _U_(0x2)                                             /**< (PMC_PLL_CFG) 30 pF  */
#define   PMC_PLL_CFG_SCA_SC_VAL_60p_Val      _U_(0x3)                                             /**< (PMC_PLL_CFG) 60 pF  */
#define PMC_PLL_CFG_SCA_SC_VAL_20p            (PMC_PLL_CFG_SCA_SC_VAL_20p_Val << PMC_PLL_CFG_SCA_Pos) /**< (PMC_PLL_CFG) 20 pF Position  */
#define PMC_PLL_CFG_SCA_SC_VAL_40p            (PMC_PLL_CFG_SCA_SC_VAL_40p_Val << PMC_PLL_CFG_SCA_Pos) /**< (PMC_PLL_CFG) 40 pF Position  */
#define PMC_PLL_CFG_SCA_SC_VAL_30p            (PMC_PLL_CFG_SCA_SC_VAL_30p_Val << PMC_PLL_CFG_SCA_Pos) /**< (PMC_PLL_CFG) 30 pF Position  */
#define PMC_PLL_CFG_SCA_SC_VAL_60p            (PMC_PLL_CFG_SCA_SC_VAL_60p_Val << PMC_PLL_CFG_SCA_Pos) /**< (PMC_PLL_CFG) 60 pF Position  */
#define PMC_PLL_CFG_SRA_Pos                   _U_(14)                                              /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Resistor Value Position */
#define PMC_PLL_CFG_SRA_Msk                   (_U_(0x3) << PMC_PLL_CFG_SRA_Pos)                    /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Resistor Value Mask */
#define PMC_PLL_CFG_SRA(value)                (PMC_PLL_CFG_SRA_Msk & ((value) << PMC_PLL_CFG_SRA_Pos))
#define   PMC_PLL_CFG_SRA_SR_VAL_24K_Val      _U_(0x0)                                             /**< (PMC_PLL_CFG) 24 Ohms  */
#define   PMC_PLL_CFG_SRA_SR_VAL_6K_Val       _U_(0x1)                                             /**< (PMC_PLL_CFG) 6 Ohms  */
#define   PMC_PLL_CFG_SRA_SR_VAL_3K_Val       _U_(0x2)                                             /**< (PMC_PLL_CFG) 3 Ohms  */
#define   PMC_PLL_CFG_SRA_SR_VAL_12K_Val      _U_(0x3)                                             /**< (PMC_PLL_CFG) 12 Ohms  */
#define PMC_PLL_CFG_SRA_SR_VAL_24K            (PMC_PLL_CFG_SRA_SR_VAL_24K_Val << PMC_PLL_CFG_SRA_Pos) /**< (PMC_PLL_CFG) 24 Ohms Position  */
#define PMC_PLL_CFG_SRA_SR_VAL_6K             (PMC_PLL_CFG_SRA_SR_VAL_6K_Val << PMC_PLL_CFG_SRA_Pos) /**< (PMC_PLL_CFG) 6 Ohms Position  */
#define PMC_PLL_CFG_SRA_SR_VAL_3K             (PMC_PLL_CFG_SRA_SR_VAL_3K_Val << PMC_PLL_CFG_SRA_Pos) /**< (PMC_PLL_CFG) 3 Ohms Position  */
#define PMC_PLL_CFG_SRA_SR_VAL_12K            (PMC_PLL_CFG_SRA_SR_VAL_12K_Val << PMC_PLL_CFG_SRA_Pos) /**< (PMC_PLL_CFG) 12 Ohms Position  */
#define PMC_PLL_CFG_OUTCUR_PLLB_Pos           _U_(16)                                              /**< (PMC_PLL_CFG) PLLB Output Current Position */
#define PMC_PLL_CFG_OUTCUR_PLLB_Msk           (_U_(0xF) << PMC_PLL_CFG_OUTCUR_PLLB_Pos)            /**< (PMC_PLL_CFG) PLLB Output Current Mask */
#define PMC_PLL_CFG_OUTCUR_PLLB(value)        (PMC_PLL_CFG_OUTCUR_PLLB_Msk & ((value) << PMC_PLL_CFG_OUTCUR_PLLB_Pos))
#define   PMC_PLL_CFG_OUTCUR_PLLB_ICP0_Val    _U_(0x0)                                             /**< (PMC_PLL_CFG) 0.5 mA  */
#define   PMC_PLL_CFG_OUTCUR_PLLB_ICP1_Val    _U_(0x1)                                             /**< (PMC_PLL_CFG) 0.75 mA  */
#define   PMC_PLL_CFG_OUTCUR_PLLB_ICP2_Val    _U_(0x2)                                             /**< (PMC_PLL_CFG) 1 mA  */
#define   PMC_PLL_CFG_OUTCUR_PLLB_ICP3_Val    _U_(0x3)                                             /**< (PMC_PLL_CFG) 1.25 mA  */
#define PMC_PLL_CFG_OUTCUR_PLLB_ICP0          (PMC_PLL_CFG_OUTCUR_PLLB_ICP0_Val << PMC_PLL_CFG_OUTCUR_PLLB_Pos) /**< (PMC_PLL_CFG) 0.5 mA Position  */
#define PMC_PLL_CFG_OUTCUR_PLLB_ICP1          (PMC_PLL_CFG_OUTCUR_PLLB_ICP1_Val << PMC_PLL_CFG_OUTCUR_PLLB_Pos) /**< (PMC_PLL_CFG) 0.75 mA Position  */
#define PMC_PLL_CFG_OUTCUR_PLLB_ICP2          (PMC_PLL_CFG_OUTCUR_PLLB_ICP2_Val << PMC_PLL_CFG_OUTCUR_PLLB_Pos) /**< (PMC_PLL_CFG) 1 mA Position  */
#define PMC_PLL_CFG_OUTCUR_PLLB_ICP3          (PMC_PLL_CFG_OUTCUR_PLLB_ICP3_Val << PMC_PLL_CFG_OUTCUR_PLLB_Pos) /**< (PMC_PLL_CFG) 1.25 mA Position  */
#define PMC_PLL_CFG_SCB_Pos                   _U_(28)                                              /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Capaticance Value Position */
#define PMC_PLL_CFG_SCB_Msk                   (_U_(0x3) << PMC_PLL_CFG_SCB_Pos)                    /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Capaticance Value Mask */
#define PMC_PLL_CFG_SCB(value)                (PMC_PLL_CFG_SCB_Msk & ((value) << PMC_PLL_CFG_SCB_Pos))
#define   PMC_PLL_CFG_SCB_SC_VAL_20p_Val      _U_(0x0)                                             /**< (PMC_PLL_CFG) 20 pF  */
#define   PMC_PLL_CFG_SCB_SC_VAL_40p_Val      _U_(0x1)                                             /**< (PMC_PLL_CFG) 40 pF  */
#define   PMC_PLL_CFG_SCB_SC_VAL_30p_Val      _U_(0x2)                                             /**< (PMC_PLL_CFG) 30 pF  */
#define   PMC_PLL_CFG_SCB_SC_VAL_60p_Val      _U_(0x3)                                             /**< (PMC_PLL_CFG) 60 pF  */
#define PMC_PLL_CFG_SCB_SC_VAL_20p            (PMC_PLL_CFG_SCB_SC_VAL_20p_Val << PMC_PLL_CFG_SCB_Pos) /**< (PMC_PLL_CFG) 20 pF Position  */
#define PMC_PLL_CFG_SCB_SC_VAL_40p            (PMC_PLL_CFG_SCB_SC_VAL_40p_Val << PMC_PLL_CFG_SCB_Pos) /**< (PMC_PLL_CFG) 40 pF Position  */
#define PMC_PLL_CFG_SCB_SC_VAL_30p            (PMC_PLL_CFG_SCB_SC_VAL_30p_Val << PMC_PLL_CFG_SCB_Pos) /**< (PMC_PLL_CFG) 30 pF Position  */
#define PMC_PLL_CFG_SCB_SC_VAL_60p            (PMC_PLL_CFG_SCB_SC_VAL_60p_Val << PMC_PLL_CFG_SCB_Pos) /**< (PMC_PLL_CFG) 60 pF Position  */
#define PMC_PLL_CFG_SRB_Pos                   _U_(30)                                              /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Resistor Value Position */
#define PMC_PLL_CFG_SRB_Msk                   (_U_(0x3) << PMC_PLL_CFG_SRB_Pos)                    /**< (PMC_PLL_CFG) Internal Filter PLL - Select Internal Resistor Value Mask */
#define PMC_PLL_CFG_SRB(value)                (PMC_PLL_CFG_SRB_Msk & ((value) << PMC_PLL_CFG_SRB_Pos))
#define   PMC_PLL_CFG_SRB_SR_VAL_24K_Val      _U_(0x0)                                             /**< (PMC_PLL_CFG) 24 Ohms  */
#define   PMC_PLL_CFG_SRB_SR_VAL_6K_Val       _U_(0x1)                                             /**< (PMC_PLL_CFG) 6 Ohms  */
#define   PMC_PLL_CFG_SRB_SR_VAL_3K_Val       _U_(0x2)                                             /**< (PMC_PLL_CFG) 3 Ohms  */
#define   PMC_PLL_CFG_SRB_SR_VAL_12K_Val      _U_(0x3)                                             /**< (PMC_PLL_CFG) 12 Ohms  */
#define PMC_PLL_CFG_SRB_SR_VAL_24K            (PMC_PLL_CFG_SRB_SR_VAL_24K_Val << PMC_PLL_CFG_SRB_Pos) /**< (PMC_PLL_CFG) 24 Ohms Position  */
#define PMC_PLL_CFG_SRB_SR_VAL_6K             (PMC_PLL_CFG_SRB_SR_VAL_6K_Val << PMC_PLL_CFG_SRB_Pos) /**< (PMC_PLL_CFG) 6 Ohms Position  */
#define PMC_PLL_CFG_SRB_SR_VAL_3K             (PMC_PLL_CFG_SRB_SR_VAL_3K_Val << PMC_PLL_CFG_SRB_Pos) /**< (PMC_PLL_CFG) 3 Ohms Position  */
#define PMC_PLL_CFG_SRB_SR_VAL_12K            (PMC_PLL_CFG_SRB_SR_VAL_12K_Val << PMC_PLL_CFG_SRB_Pos) /**< (PMC_PLL_CFG) 12 Ohms Position  */
#define PMC_PLL_CFG_Msk                       _U_(0xF00FF00F)                                      /**< (PMC_PLL_CFG) Register Mask  */


