Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_CPULIM : (PMC Offset: 0x160) (R/W 32) CPU Monitor Limits Register -------- */
#define PMC_CPULIM_CPU_LOW_IT_Pos             _U_(0)                                               /**< (PMC_CPULIM) CPU Monitoring Low IT Limit Position */
#define PMC_CPULIM_CPU_LOW_IT_Msk             (_U_(0xFF) << PMC_CPULIM_CPU_LOW_IT_Pos)             /**< (PMC_CPULIM) CPU Monitoring Low IT Limit Mask */
#define PMC_CPULIM_CPU_LOW_IT(value)          (PMC_CPULIM_CPU_LOW_IT_Msk & ((value) << PMC_CPULIM_CPU_LOW_IT_Pos))
#define PMC_CPULIM_CPU_HIGH_IT_Pos            _U_(8)                                               /**< (PMC_CPULIM) CPU Monitoring High IT Limit Position */
#define PMC_CPULIM_CPU_HIGH_IT_Msk            (_U_(0xFF) << PMC_CPULIM_CPU_HIGH_IT_Pos)            /**< (PMC_CPULIM) CPU Monitoring High IT Limit Mask */
#define PMC_CPULIM_CPU_HIGH_IT(value)         (PMC_CPULIM_CPU_HIGH_IT_Msk & ((value) << PMC_CPULIM_CPU_HIGH_IT_Pos))
#define PMC_CPULIM_CPU_LOW_RES_Pos            _U_(16)                                              /**< (PMC_CPULIM) CPU Monitoring Low RESET Limit Position */
#define PMC_CPULIM_CPU_LOW_RES_Msk            (_U_(0xFF) << PMC_CPULIM_CPU_LOW_RES_Pos)            /**< (PMC_CPULIM) CPU Monitoring Low RESET Limit Mask */
#define PMC_CPULIM_CPU_LOW_RES(value)         (PMC_CPULIM_CPU_LOW_RES_Msk & ((value) << PMC_CPULIM_CPU_LOW_RES_Pos))
#define PMC_CPULIM_CPU_HIGH_RES_Pos           _U_(24)                                              /**< (PMC_CPULIM) CPU Monitoring High Reset Limit Position */
#define PMC_CPULIM_CPU_HIGH_RES_Msk           (_U_(0xFF) << PMC_CPULIM_CPU_HIGH_RES_Pos)           /**< (PMC_CPULIM) CPU Monitoring High Reset Limit Mask */
#define PMC_CPULIM_CPU_HIGH_RES(value)        (PMC_CPULIM_CPU_HIGH_RES_Msk & ((value) << PMC_CPULIM_CPU_HIGH_RES_Pos))
#define PMC_CPULIM_Msk                        _U_(0xFFFFFFFF)                                      /**< (PMC_CPULIM) Register Mask  */


/* -------- PMC_CSR0 : (PMC Offset: 0x170) ( R/ 32) Peripheral Clock Status Register 0 -------- */
#define PMC_CSR0_PID0_Pos                     _U_(0)                                               /**< (PMC_CSR0) Peripheral Clock 0 Status Position */
#define PMC_CSR0_PID0_Msk                     (_U_(0x1) << PMC_CSR0_PID0_Pos)                      /**< (PMC_CSR0) Peripheral Clock 0 Status Mask */
#define PMC_CSR0_PID0(value)                  (PMC_CSR0_PID0_Msk & ((value) << PMC_CSR0_PID0_Pos))
#define PMC_CSR0_PID1_Pos                     _U_(1)                                               /**< (PMC_CSR0) Peripheral Clock 1 Status Position */
#define PMC_CSR0_PID1_Msk                     (_U_(0x1) << PMC_CSR0_PID1_Pos)                      /**< (PMC_CSR0) Peripheral Clock 1 Status Mask */
#define PMC_CSR0_PID1(value)                  (PMC_CSR0_PID1_Msk & ((value) << PMC_CSR0_PID1_Pos))
#define PMC_CSR0_PID2_Pos                     _U_(2)                                               /**< (PMC_CSR0) Peripheral Clock 2 Status Position */
#define PMC_CSR0_PID2_Msk                     (_U_(0x1) << PMC_CSR0_PID2_Pos)                      /**< (PMC_CSR0) Peripheral Clock 2 Status Mask */
#define PMC_CSR0_PID2(value)                  (PMC_CSR0_PID2_Msk & ((value) << PMC_CSR0_PID2_Pos))
#define PMC_CSR0_PID3_Pos                     _U_(3)                                               /**< (PMC_CSR0) Peripheral Clock 3 Status Position */
#define PMC_CSR0_PID3_Msk                     (_U_(0x1) << PMC_CSR0_PID3_Pos)                      /**< (PMC_CSR0) Peripheral Clock 3 Status Mask */
#define PMC_CSR0_PID3(value)                  (PMC_CSR0_PID3_Msk & ((value) << PMC_CSR0_PID3_Pos))
#define PMC_CSR0_PID4_Pos                     _U_(4)                                               /**< (PMC_CSR0) Peripheral Clock 4 Status Position */
#define PMC_CSR0_PID4_Msk                     (_U_(0x1) << PMC_CSR0_PID4_Pos)                      /**< (PMC_CSR0) Peripheral Clock 4 Status Mask */
#define PMC_CSR0_PID4(value)                  (PMC_CSR0_PID4_Msk & ((value) << PMC_CSR0_PID4_Pos))
#define PMC_CSR0_PID5_Pos                     _U_(5)                                               /**< (PMC_CSR0) Peripheral Clock 5 Status Position */
#define PMC_CSR0_PID5_Msk                     (_U_(0x1) << PMC_CSR0_PID5_Pos)                      /**< (PMC_CSR0) Peripheral Clock 5 Status Mask */
#define PMC_CSR0_PID5(value)                  (PMC_CSR0_PID5_Msk & ((value) << PMC_CSR0_PID5_Pos))
#define PMC_CSR0_PID6_Pos                     _U_(6)                                               /**< (PMC_CSR0) Peripheral Clock 6 Status Position */
#define PMC_CSR0_PID6_Msk                     (_U_(0x1) << PMC_CSR0_PID6_Pos)                      /**< (PMC_CSR0) Peripheral Clock 6 Status Mask */
#define PMC_CSR0_PID6(value)                  (PMC_CSR0_PID6_Msk & ((value) << PMC_CSR0_PID6_Pos))
#define PMC_CSR0_PID7_Pos                     _U_(7)                                               /**< (PMC_CSR0) Peripheral Clock 7 Status Position */
#define PMC_CSR0_PID7_Msk                     (_U_(0x1) << PMC_CSR0_PID7_Pos)                      /**< (PMC_CSR0) Peripheral Clock 7 Status Mask */
#define PMC_CSR0_PID7(value)                  (PMC_CSR0_PID7_Msk & ((value) << PMC_CSR0_PID7_Pos))
#define PMC_CSR0_PID8_Pos                     _U_(8)                                               /**< (PMC_CSR0) Peripheral Clock 8 Status Position */
#define PMC_CSR0_PID8_Msk                     (_U_(0x1) << PMC_CSR0_PID8_Pos)                      /**< (PMC_CSR0) Peripheral Clock 8 Status Mask */
#define PMC_CSR0_PID8(value)                  (PMC_CSR0_PID8_Msk & ((value) << PMC_CSR0_PID8_Pos))
#define PMC_CSR0_PID9_Pos                     _U_(9)                                               /**< (PMC_CSR0) Peripheral Clock 9 Status Position */
#define PMC_CSR0_PID9_Msk                     (_U_(0x1) << PMC_CSR0_PID9_Pos)                      /**< (PMC_CSR0) Peripheral Clock 9 Status Mask */
#define PMC_CSR0_PID9(value)                  (PMC_CSR0_PID9_Msk & ((value) << PMC_CSR0_PID9_Pos))
#define PMC_CSR0_PID10_Pos                    _U_(10)                                              /**< (PMC_CSR0) Peripheral Clock 10 Status Position */
#define PMC_CSR0_PID10_Msk                    (_U_(0x1) << PMC_CSR0_PID10_Pos)                     /**< (PMC_CSR0) Peripheral Clock 10 Status Mask */
#define PMC_CSR0_PID10(value)                 (PMC_CSR0_PID10_Msk & ((value) << PMC_CSR0_PID10_Pos))
#define PMC_CSR0_PID11_Pos                    _U_(11)                                              /**< (PMC_CSR0) Peripheral Clock 11 Status Position */
#define PMC_CSR0_PID11_Msk                    (_U_(0x1) << PMC_CSR0_PID11_Pos)                     /**< (PMC_CSR0) Peripheral Clock 11 Status Mask */
#define PMC_CSR0_PID11(value)                 (PMC_CSR0_PID11_Msk & ((value) << PMC_CSR0_PID11_Pos))
#define PMC_CSR0_PID12_Pos                    _U_(12)                                              /**< (PMC_CSR0) Peripheral Clock 12 Status Position */
#define PMC_CSR0_PID12_Msk                    (_U_(0x1) << PMC_CSR0_PID12_Pos)                     /**< (PMC_CSR0) Peripheral Clock 12 Status Mask */
#define PMC_CSR0_PID12(value)                 (PMC_CSR0_PID12_Msk & ((value) << PMC_CSR0_PID12_Pos))
#define PMC_CSR0_PID13_Pos                    _U_(13)                                              /**< (PMC_CSR0) Peripheral Clock 13 Status Position */
#define PMC_CSR0_PID13_Msk                    (_U_(0x1) << PMC_CSR0_PID13_Pos)                     /**< (PMC_CSR0) Peripheral Clock 13 Status Mask */
#define PMC_CSR0_PID13(value)                 (PMC_CSR0_PID13_Msk & ((value) << PMC_CSR0_PID13_Pos))
#define PMC_CSR0_PID14_Pos                    _U_(14)                                              /**< (PMC_CSR0) Peripheral Clock 14 Status Position */
#define PMC_CSR0_PID14_Msk                    (_U_(0x1) << PMC_CSR0_PID14_Pos)                     /**< (PMC_CSR0) Peripheral Clock 14 Status Mask */
#define PMC_CSR0_PID14(value)                 (PMC_CSR0_PID14_Msk & ((value) << PMC_CSR0_PID14_Pos))
#define PMC_CSR0_PID15_Pos                    _U_(15)                                              /**< (PMC_CSR0) Peripheral Clock 15 Status Position */
#define PMC_CSR0_PID15_Msk                    (_U_(0x1) << PMC_CSR0_PID15_Pos)                     /**< (PMC_CSR0) Peripheral Clock 15 Status Mask */
#define PMC_CSR0_PID15(value)                 (PMC_CSR0_PID15_Msk & ((value) << PMC_CSR0_PID15_Pos))
#define PMC_CSR0_PID16_Pos                    _U_(16)                                              /**< (PMC_CSR0) Peripheral Clock 16 Status Position */
#define PMC_CSR0_PID16_Msk                    (_U_(0x1) << PMC_CSR0_PID16_Pos)                     /**< (PMC_CSR0) Peripheral Clock 16 Status Mask */
#define PMC_CSR0_PID16(value)                 (PMC_CSR0_PID16_Msk & ((value) << PMC_CSR0_PID16_Pos))
#define PMC_CSR0_PID17_Pos                    _U_(17)                                              /**< (PMC_CSR0) Peripheral Clock 17 Status Position */
#define PMC_CSR0_PID17_Msk                    (_U_(0x1) << PMC_CSR0_PID17_Pos)                     /**< (PMC_CSR0) Peripheral Clock 17 Status Mask */
#define PMC_CSR0_PID17(value)                 (PMC_CSR0_PID17_Msk & ((value) << PMC_CSR0_PID17_Pos))
#define PMC_CSR0_PID18_Pos                    _U_(18)                                              /**< (PMC_CSR0) Peripheral Clock 18 Status Position */
#define PMC_CSR0_PID18_Msk                    (_U_(0x1) << PMC_CSR0_PID18_Pos)                     /**< (PMC_CSR0) Peripheral Clock 18 Status Mask */
#define PMC_CSR0_PID18(value)                 (PMC_CSR0_PID18_Msk & ((value) << PMC_CSR0_PID18_Pos))
#define PMC_CSR0_PID19_Pos                    _U_(19)                                              /**< (PMC_CSR0) Peripheral Clock 19 Status Position */
#define PMC_CSR0_PID19_Msk                    (_U_(0x1) << PMC_CSR0_PID19_Pos)                     /**< (PMC_CSR0) Peripheral Clock 19 Status Mask */
#define PMC_CSR0_PID19(value)                 (PMC_CSR0_PID19_Msk & ((value) << PMC_CSR0_PID19_Pos))
#define PMC_CSR0_PID20_Pos                    _U_(20)                                              /**< (PMC_CSR0) Peripheral Clock 20 Status Position */
#define PMC_CSR0_PID20_Msk                    (_U_(0x1) << PMC_CSR0_PID20_Pos)                     /**< (PMC_CSR0) Peripheral Clock 20 Status Mask */
#define PMC_CSR0_PID20(value)                 (PMC_CSR0_PID20_Msk & ((value) << PMC_CSR0_PID20_Pos))
#define PMC_CSR0_PID21_Pos                    _U_(21)                                              /**< (PMC_CSR0) Peripheral Clock 21 Status Position */
#define PMC_CSR0_PID21_Msk                    (_U_(0x1) << PMC_CSR0_PID21_Pos)                     /**< (PMC_CSR0) Peripheral Clock 21 Status Mask */
#define PMC_CSR0_PID21(value)                 (PMC_CSR0_PID21_Msk & ((value) << PMC_CSR0_PID21_Pos))
#define PMC_CSR0_PID22_Pos                    _U_(22)                                              /**< (PMC_CSR0) Peripheral Clock 22 Status Position */
#define PMC_CSR0_PID22_Msk                    (_U_(0x1) << PMC_CSR0_PID22_Pos)                     /**< (PMC_CSR0) Peripheral Clock 22 Status Mask */
#define PMC_CSR0_PID22(value)                 (PMC_CSR0_PID22_Msk & ((value) << PMC_CSR0_PID22_Pos))
#define PMC_CSR0_PID23_Pos                    _U_(23)                                              /**< (PMC_CSR0) Peripheral Clock 23 Status Position */
#define PMC_CSR0_PID23_Msk                    (_U_(0x1) << PMC_CSR0_PID23_Pos)                     /**< (PMC_CSR0) Peripheral Clock 23 Status Mask */
#define PMC_CSR0_PID23(value)                 (PMC_CSR0_PID23_Msk & ((value) << PMC_CSR0_PID23_Pos))
#define PMC_CSR0_PID24_Pos                    _U_(24)                                              /**< (PMC_CSR0) Peripheral Clock 24 Status Position */
#define PMC_CSR0_PID24_Msk                    (_U_(0x1) << PMC_CSR0_PID24_Pos)                     /**< (PMC_CSR0) Peripheral Clock 24 Status Mask */
#define PMC_CSR0_PID24(value)                 (PMC_CSR0_PID24_Msk & ((value) << PMC_CSR0_PID24_Pos))
#define PMC_CSR0_PID25_Pos                    _U_(25)                                              /**< (PMC_CSR0) Peripheral Clock 25 Status Position */
#define PMC_CSR0_PID25_Msk                    (_U_(0x1) << PMC_CSR0_PID25_Pos)                     /**< (PMC_CSR0) Peripheral Clock 25 Status Mask */
#define PMC_CSR0_PID25(value)                 (PMC_CSR0_PID25_Msk & ((value) << PMC_CSR0_PID25_Pos))
#define PMC_CSR0_PID26_Pos                    _U_(26)                                              /**< (PMC_CSR0) Peripheral Clock 26 Status Position */
#define PMC_CSR0_PID26_Msk                    (_U_(0x1) << PMC_CSR0_PID26_Pos)                     /**< (PMC_CSR0) Peripheral Clock 26 Status Mask */
#define PMC_CSR0_PID26(value)                 (PMC_CSR0_PID26_Msk & ((value) << PMC_CSR0_PID26_Pos))
#define PMC_CSR0_PID27_Pos                    _U_(27)                                              /**< (PMC_CSR0) Peripheral Clock 27 Status Position */
#define PMC_CSR0_PID27_Msk                    (_U_(0x1) << PMC_CSR0_PID27_Pos)                     /**< (PMC_CSR0) Peripheral Clock 27 Status Mask */
#define PMC_CSR0_PID27(value)                 (PMC_CSR0_PID27_Msk & ((value) << PMC_CSR0_PID27_Pos))
#define PMC_CSR0_PID28_Pos                    _U_(28)                                              /**< (PMC_CSR0) Peripheral Clock 28 Status Position */
#define PMC_CSR0_PID28_Msk                    (_U_(0x1) << PMC_CSR0_PID28_Pos)                     /**< (PMC_CSR0) Peripheral Clock 28 Status Mask */
#define PMC_CSR0_PID28(value)                 (PMC_CSR0_PID28_Msk & ((value) << PMC_CSR0_PID28_Pos))
#define PMC_CSR0_PID29_Pos                    _U_(29)                                              /**< (PMC_CSR0) Peripheral Clock 29 Status Position */
#define PMC_CSR0_PID29_Msk                    (_U_(0x1) << PMC_CSR0_PID29_Pos)                     /**< (PMC_CSR0) Peripheral Clock 29 Status Mask */
#define PMC_CSR0_PID29(value)                 (PMC_CSR0_PID29_Msk & ((value) << PMC_CSR0_PID29_Pos))
#define PMC_CSR0_PID30_Pos                    _U_(30)                                              /**< (PMC_CSR0) Peripheral Clock 30 Status Position */
#define PMC_CSR0_PID30_Msk                    (_U_(0x1) << PMC_CSR0_PID30_Pos)                     /**< (PMC_CSR0) Peripheral Clock 30 Status Mask */
#define PMC_CSR0_PID30(value)                 (PMC_CSR0_PID30_Msk & ((value) << PMC_CSR0_PID30_Pos))
#define PMC_CSR0_PID31_Pos                    _U_(31)                                              /**< (PMC_CSR0) Peripheral Clock 31 Status Position */
#define PMC_CSR0_PID31_Msk                    (_U_(0x1) << PMC_CSR0_PID31_Pos)                     /**< (PMC_CSR0) Peripheral Clock 31 Status Mask */
#define PMC_CSR0_PID31(value)                 (PMC_CSR0_PID31_Msk & ((value) << PMC_CSR0_PID31_Pos))
#define PMC_CSR0_Msk                          _U_(0xFFFFFFFF)                                      /**< (PMC_CSR0) Register Mask  */

#define PMC_CSR0_PID_Pos                      _U_(0)                                               /**< (PMC_CSR0 Position) Peripheral Clock 3x Status */
#define PMC_CSR0_PID_Msk                      (_U_(0xFFFFFFFF) << PMC_CSR0_PID_Pos)                /**< (PMC_CSR0 Mask) PID */
#define PMC_CSR0_PID(value)                   (PMC_CSR0_PID_Msk & ((value) << PMC_CSR0_PID_Pos))   

