Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_CSR1 : (PMC Offset: 0x174) ( R/ 32) Peripheral Clock Status Register 1 -------- */
#define PMC_CSR1_PID32_Pos                    _U_(0)                                               /**< (PMC_CSR1) Peripheral Clock 32 Status Position */
#define PMC_CSR1_PID32_Msk                    (_U_(0x1) << PMC_CSR1_PID32_Pos)                     /**< (PMC_CSR1) Peripheral Clock 32 Status Mask */
#define PMC_CSR1_PID32(value)                 (PMC_CSR1_PID32_Msk & ((value) << PMC_CSR1_PID32_Pos))
#define PMC_CSR1_PID33_Pos                    _U_(1)                                               /**< (PMC_CSR1) Peripheral Clock 33 Status Position */
#define PMC_CSR1_PID33_Msk                    (_U_(0x1) << PMC_CSR1_PID33_Pos)                     /**< (PMC_CSR1) Peripheral Clock 33 Status Mask */
#define PMC_CSR1_PID33(value)                 (PMC_CSR1_PID33_Msk & ((value) << PMC_CSR1_PID33_Pos))
#define PMC_CSR1_PID34_Pos                    _U_(2)                                               /**< (PMC_CSR1) Peripheral Clock 34 Status Position */
#define PMC_CSR1_PID34_Msk                    (_U_(0x1) << PMC_CSR1_PID34_Pos)                     /**< (PMC_CSR1) Peripheral Clock 34 Status Mask */
#define PMC_CSR1_PID34(value)                 (PMC_CSR1_PID34_Msk & ((value) << PMC_CSR1_PID34_Pos))
#define PMC_CSR1_PID35_Pos                    _U_(3)                                               /**< (PMC_CSR1) Peripheral Clock 35 Status Position */
#define PMC_CSR1_PID35_Msk                    (_U_(0x1) << PMC_CSR1_PID35_Pos)                     /**< (PMC_CSR1) Peripheral Clock 35 Status Mask */
#define PMC_CSR1_PID35(value)                 (PMC_CSR1_PID35_Msk & ((value) << PMC_CSR1_PID35_Pos))
#define PMC_CSR1_PID36_Pos                    _U_(4)                                               /**< (PMC_CSR1) Peripheral Clock 36 Status Position */
#define PMC_CSR1_PID36_Msk                    (_U_(0x1) << PMC_CSR1_PID36_Pos)                     /**< (PMC_CSR1) Peripheral Clock 36 Status Mask */
#define PMC_CSR1_PID36(value)                 (PMC_CSR1_PID36_Msk & ((value) << PMC_CSR1_PID36_Pos))
#define PMC_CSR1_PID37_Pos                    _U_(5)                                               /**< (PMC_CSR1) Peripheral Clock 37 Status Position */
#define PMC_CSR1_PID37_Msk                    (_U_(0x1) << PMC_CSR1_PID37_Pos)                     /**< (PMC_CSR1) Peripheral Clock 37 Status Mask */
#define PMC_CSR1_PID37(value)                 (PMC_CSR1_PID37_Msk & ((value) << PMC_CSR1_PID37_Pos))
#define PMC_CSR1_PID38_Pos                    _U_(6)                                               /**< (PMC_CSR1) Peripheral Clock 38 Status Position */
#define PMC_CSR1_PID38_Msk                    (_U_(0x1) << PMC_CSR1_PID38_Pos)                     /**< (PMC_CSR1) Peripheral Clock 38 Status Mask */
#define PMC_CSR1_PID38(value)                 (PMC_CSR1_PID38_Msk & ((value) << PMC_CSR1_PID38_Pos))
#define PMC_CSR1_PID39_Pos                    _U_(7)                                               /**< (PMC_CSR1) Peripheral Clock 39 Status Position */
#define PMC_CSR1_PID39_Msk                    (_U_(0x1) << PMC_CSR1_PID39_Pos)                     /**< (PMC_CSR1) Peripheral Clock 39 Status Mask */
#define PMC_CSR1_PID39(value)                 (PMC_CSR1_PID39_Msk & ((value) << PMC_CSR1_PID39_Pos))
#define PMC_CSR1_PID40_Pos                    _U_(8)                                               /**< (PMC_CSR1) Peripheral Clock 40 Status Position */
#define PMC_CSR1_PID40_Msk                    (_U_(0x1) << PMC_CSR1_PID40_Pos)                     /**< (PMC_CSR1) Peripheral Clock 40 Status Mask */
#define PMC_CSR1_PID40(value)                 (PMC_CSR1_PID40_Msk & ((value) << PMC_CSR1_PID40_Pos))
#define PMC_CSR1_PID41_Pos                    _U_(9)                                               /**< (PMC_CSR1) Peripheral Clock 41 Status Position */
#define PMC_CSR1_PID41_Msk                    (_U_(0x1) << PMC_CSR1_PID41_Pos)                     /**< (PMC_CSR1) Peripheral Clock 41 Status Mask */
#define PMC_CSR1_PID41(value)                 (PMC_CSR1_PID41_Msk & ((value) << PMC_CSR1_PID41_Pos))
#define PMC_CSR1_PID42_Pos                    _U_(10)                                              /**< (PMC_CSR1) Peripheral Clock 42 Status Position */
#define PMC_CSR1_PID42_Msk                    (_U_(0x1) << PMC_CSR1_PID42_Pos)                     /**< (PMC_CSR1) Peripheral Clock 42 Status Mask */
#define PMC_CSR1_PID42(value)                 (PMC_CSR1_PID42_Msk & ((value) << PMC_CSR1_PID42_Pos))
#define PMC_CSR1_PID43_Pos                    _U_(11)                                              /**< (PMC_CSR1) Peripheral Clock 43 Status Position */
#define PMC_CSR1_PID43_Msk                    (_U_(0x1) << PMC_CSR1_PID43_Pos)                     /**< (PMC_CSR1) Peripheral Clock 43 Status Mask */
#define PMC_CSR1_PID43(value)                 (PMC_CSR1_PID43_Msk & ((value) << PMC_CSR1_PID43_Pos))
#define PMC_CSR1_PID44_Pos                    _U_(12)                                              /**< (PMC_CSR1) Peripheral Clock 44 Status Position */
#define PMC_CSR1_PID44_Msk                    (_U_(0x1) << PMC_CSR1_PID44_Pos)                     /**< (PMC_CSR1) Peripheral Clock 44 Status Mask */
#define PMC_CSR1_PID44(value)                 (PMC_CSR1_PID44_Msk & ((value) << PMC_CSR1_PID44_Pos))
#define PMC_CSR1_PID45_Pos                    _U_(13)                                              /**< (PMC_CSR1) Peripheral Clock 45 Status Position */
#define PMC_CSR1_PID45_Msk                    (_U_(0x1) << PMC_CSR1_PID45_Pos)                     /**< (PMC_CSR1) Peripheral Clock 45 Status Mask */
#define PMC_CSR1_PID45(value)                 (PMC_CSR1_PID45_Msk & ((value) << PMC_CSR1_PID45_Pos))
#define PMC_CSR1_PID46_Pos                    _U_(14)                                              /**< (PMC_CSR1) Peripheral Clock 46 Status Position */
#define PMC_CSR1_PID46_Msk                    (_U_(0x1) << PMC_CSR1_PID46_Pos)                     /**< (PMC_CSR1) Peripheral Clock 46 Status Mask */
#define PMC_CSR1_PID46(value)                 (PMC_CSR1_PID46_Msk & ((value) << PMC_CSR1_PID46_Pos))
#define PMC_CSR1_PID47_Pos                    _U_(15)                                              /**< (PMC_CSR1) Peripheral Clock 47 Status Position */
#define PMC_CSR1_PID47_Msk                    (_U_(0x1) << PMC_CSR1_PID47_Pos)                     /**< (PMC_CSR1) Peripheral Clock 47 Status Mask */
#define PMC_CSR1_PID47(value)                 (PMC_CSR1_PID47_Msk & ((value) << PMC_CSR1_PID47_Pos))
#define PMC_CSR1_PID48_Pos                    _U_(16)                                              /**< (PMC_CSR1) Peripheral Clock 48 Status Position */
#define PMC_CSR1_PID48_Msk                    (_U_(0x1) << PMC_CSR1_PID48_Pos)                     /**< (PMC_CSR1) Peripheral Clock 48 Status Mask */
#define PMC_CSR1_PID48(value)                 (PMC_CSR1_PID48_Msk & ((value) << PMC_CSR1_PID48_Pos))
#define PMC_CSR1_PID49_Pos                    _U_(17)                                              /**< (PMC_CSR1) Peripheral Clock 49 Status Position */
#define PMC_CSR1_PID49_Msk                    (_U_(0x1) << PMC_CSR1_PID49_Pos)                     /**< (PMC_CSR1) Peripheral Clock 49 Status Mask */
#define PMC_CSR1_PID49(value)                 (PMC_CSR1_PID49_Msk & ((value) << PMC_CSR1_PID49_Pos))
#define PMC_CSR1_PID50_Pos                    _U_(18)                                              /**< (PMC_CSR1) Peripheral Clock 50 Status Position */
#define PMC_CSR1_PID50_Msk                    (_U_(0x1) << PMC_CSR1_PID50_Pos)                     /**< (PMC_CSR1) Peripheral Clock 50 Status Mask */
#define PMC_CSR1_PID50(value)                 (PMC_CSR1_PID50_Msk & ((value) << PMC_CSR1_PID50_Pos))
#define PMC_CSR1_PID51_Pos                    _U_(19)                                              /**< (PMC_CSR1) Peripheral Clock 51 Status Position */
#define PMC_CSR1_PID51_Msk                    (_U_(0x1) << PMC_CSR1_PID51_Pos)                     /**< (PMC_CSR1) Peripheral Clock 51 Status Mask */
#define PMC_CSR1_PID51(value)                 (PMC_CSR1_PID51_Msk & ((value) << PMC_CSR1_PID51_Pos))
#define PMC_CSR1_PID52_Pos                    _U_(20)                                              /**< (PMC_CSR1) Peripheral Clock 52 Status Position */
#define PMC_CSR1_PID52_Msk                    (_U_(0x1) << PMC_CSR1_PID52_Pos)                     /**< (PMC_CSR1) Peripheral Clock 52 Status Mask */
#define PMC_CSR1_PID52(value)                 (PMC_CSR1_PID52_Msk & ((value) << PMC_CSR1_PID52_Pos))
#define PMC_CSR1_PID53_Pos                    _U_(21)                                              /**< (PMC_CSR1) Peripheral Clock 53 Status Position */
#define PMC_CSR1_PID53_Msk                    (_U_(0x1) << PMC_CSR1_PID53_Pos)                     /**< (PMC_CSR1) Peripheral Clock 53 Status Mask */
#define PMC_CSR1_PID53(value)                 (PMC_CSR1_PID53_Msk & ((value) << PMC_CSR1_PID53_Pos))
#define PMC_CSR1_PID54_Pos                    _U_(22)                                              /**< (PMC_CSR1) Peripheral Clock 54 Status Position */
#define PMC_CSR1_PID54_Msk                    (_U_(0x1) << PMC_CSR1_PID54_Pos)                     /**< (PMC_CSR1) Peripheral Clock 54 Status Mask */
#define PMC_CSR1_PID54(value)                 (PMC_CSR1_PID54_Msk & ((value) << PMC_CSR1_PID54_Pos))
#define PMC_CSR1_PID55_Pos                    _U_(23)                                              /**< (PMC_CSR1) Peripheral Clock 55 Status Position */
#define PMC_CSR1_PID55_Msk                    (_U_(0x1) << PMC_CSR1_PID55_Pos)                     /**< (PMC_CSR1) Peripheral Clock 55 Status Mask */
#define PMC_CSR1_PID55(value)                 (PMC_CSR1_PID55_Msk & ((value) << PMC_CSR1_PID55_Pos))
#define PMC_CSR1_PID56_Pos                    _U_(24)                                              /**< (PMC_CSR1) Peripheral Clock 56 Status Position */
#define PMC_CSR1_PID56_Msk                    (_U_(0x1) << PMC_CSR1_PID56_Pos)                     /**< (PMC_CSR1) Peripheral Clock 56 Status Mask */
#define PMC_CSR1_PID56(value)                 (PMC_CSR1_PID56_Msk & ((value) << PMC_CSR1_PID56_Pos))
#define PMC_CSR1_PID57_Pos                    _U_(25)                                              /**< (PMC_CSR1) Peripheral Clock 57 Status Position */
#define PMC_CSR1_PID57_Msk                    (_U_(0x1) << PMC_CSR1_PID57_Pos)                     /**< (PMC_CSR1) Peripheral Clock 57 Status Mask */
#define PMC_CSR1_PID57(value)                 (PMC_CSR1_PID57_Msk & ((value) << PMC_CSR1_PID57_Pos))
#define PMC_CSR1_PID58_Pos                    _U_(26)                                              /**< (PMC_CSR1) Peripheral Clock 58 Status Position */
#define PMC_CSR1_PID58_Msk                    (_U_(0x1) << PMC_CSR1_PID58_Pos)                     /**< (PMC_CSR1) Peripheral Clock 58 Status Mask */
#define PMC_CSR1_PID58(value)                 (PMC_CSR1_PID58_Msk & ((value) << PMC_CSR1_PID58_Pos))
#define PMC_CSR1_PID59_Pos                    _U_(27)                                              /**< (PMC_CSR1) Peripheral Clock 59 Status Position */
#define PMC_CSR1_PID59_Msk                    (_U_(0x1) << PMC_CSR1_PID59_Pos)                     /**< (PMC_CSR1) Peripheral Clock 59 Status Mask */
#define PMC_CSR1_PID59(value)                 (PMC_CSR1_PID59_Msk & ((value) << PMC_CSR1_PID59_Pos))
#define PMC_CSR1_PID60_Pos                    _U_(28)                                              /**< (PMC_CSR1) Peripheral Clock 60 Status Position */
#define PMC_CSR1_PID60_Msk                    (_U_(0x1) << PMC_CSR1_PID60_Pos)                     /**< (PMC_CSR1) Peripheral Clock 60 Status Mask */
#define PMC_CSR1_PID60(value)                 (PMC_CSR1_PID60_Msk & ((value) << PMC_CSR1_PID60_Pos))
#define PMC_CSR1_PID61_Pos                    _U_(29)                                              /**< (PMC_CSR1) Peripheral Clock 61 Status Position */
#define PMC_CSR1_PID61_Msk                    (_U_(0x1) << PMC_CSR1_PID61_Pos)                     /**< (PMC_CSR1) Peripheral Clock 61 Status Mask */
#define PMC_CSR1_PID61(value)                 (PMC_CSR1_PID61_Msk & ((value) << PMC_CSR1_PID61_Pos))
#define PMC_CSR1_PID62_Pos                    _U_(30)                                              /**< (PMC_CSR1) Peripheral Clock 62 Status Position */
#define PMC_CSR1_PID62_Msk                    (_U_(0x1) << PMC_CSR1_PID62_Pos)                     /**< (PMC_CSR1) Peripheral Clock 62 Status Mask */
#define PMC_CSR1_PID62(value)                 (PMC_CSR1_PID62_Msk & ((value) << PMC_CSR1_PID62_Pos))
#define PMC_CSR1_PID63_Pos                    _U_(31)                                              /**< (PMC_CSR1) Peripheral Clock 63 Status Position */
#define PMC_CSR1_PID63_Msk                    (_U_(0x1) << PMC_CSR1_PID63_Pos)                     /**< (PMC_CSR1) Peripheral Clock 63 Status Mask */
#define PMC_CSR1_PID63(value)                 (PMC_CSR1_PID63_Msk & ((value) << PMC_CSR1_PID63_Pos))
#define PMC_CSR1_Msk                          _U_(0xFFFFFFFF)                                      /**< (PMC_CSR1) Register Mask  */

#define PMC_CSR1_PID_Pos                      _U_(0)                                               /**< (PMC_CSR1 Position) Peripheral Clock 63 Status */
#define PMC_CSR1_PID_Msk                      (_U_(0xFFFFFFFF) << PMC_CSR1_PID_Pos)                /**< (PMC_CSR1 Mask) PID */
#define PMC_CSR1_PID(value)                   (PMC_CSR1_PID_Msk & ((value) << PMC_CSR1_PID_Pos))   

