Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_CSR2 : (PMC Offset: 0x178) ( R/ 32) Peripheral Clock Status Register 2 -------- */
#define PMC_CSR2_PID64_Pos                    _U_(0)                                               /**< (PMC_CSR2) Peripheral Clock 64 Status Position */
#define PMC_CSR2_PID64_Msk                    (_U_(0x1) << PMC_CSR2_PID64_Pos)                     /**< (PMC_CSR2) Peripheral Clock 64 Status Mask */
#define PMC_CSR2_PID64(value)                 (PMC_CSR2_PID64_Msk & ((value) << PMC_CSR2_PID64_Pos))
#define PMC_CSR2_PID65_Pos                    _U_(1)                                               /**< (PMC_CSR2) Peripheral Clock 65 Status Position */
#define PMC_CSR2_PID65_Msk                    (_U_(0x1) << PMC_CSR2_PID65_Pos)                     /**< (PMC_CSR2) Peripheral Clock 65 Status Mask */
#define PMC_CSR2_PID65(value)                 (PMC_CSR2_PID65_Msk & ((value) << PMC_CSR2_PID65_Pos))
#define PMC_CSR2_PID66_Pos                    _U_(2)                                               /**< (PMC_CSR2) Peripheral Clock 66 Status Position */
#define PMC_CSR2_PID66_Msk                    (_U_(0x1) << PMC_CSR2_PID66_Pos)                     /**< (PMC_CSR2) Peripheral Clock 66 Status Mask */
#define PMC_CSR2_PID66(value)                 (PMC_CSR2_PID66_Msk & ((value) << PMC_CSR2_PID66_Pos))
#define PMC_CSR2_PID67_Pos                    _U_(3)                                               /**< (PMC_CSR2) Peripheral Clock 67 Status Position */
#define PMC_CSR2_PID67_Msk                    (_U_(0x1) << PMC_CSR2_PID67_Pos)                     /**< (PMC_CSR2) Peripheral Clock 67 Status Mask */
#define PMC_CSR2_PID67(value)                 (PMC_CSR2_PID67_Msk & ((value) << PMC_CSR2_PID67_Pos))
#define PMC_CSR2_PID68_Pos                    _U_(4)                                               /**< (PMC_CSR2) Peripheral Clock 68 Status Position */
#define PMC_CSR2_PID68_Msk                    (_U_(0x1) << PMC_CSR2_PID68_Pos)                     /**< (PMC_CSR2) Peripheral Clock 68 Status Mask */
#define PMC_CSR2_PID68(value)                 (PMC_CSR2_PID68_Msk & ((value) << PMC_CSR2_PID68_Pos))
#define PMC_CSR2_PID69_Pos                    _U_(5)                                               /**< (PMC_CSR2) Peripheral Clock 69 Status Position */
#define PMC_CSR2_PID69_Msk                    (_U_(0x1) << PMC_CSR2_PID69_Pos)                     /**< (PMC_CSR2) Peripheral Clock 69 Status Mask */
#define PMC_CSR2_PID69(value)                 (PMC_CSR2_PID69_Msk & ((value) << PMC_CSR2_PID69_Pos))
#define PMC_CSR2_PID70_Pos                    _U_(6)                                               /**< (PMC_CSR2) Peripheral Clock 70 Status Position */
#define PMC_CSR2_PID70_Msk                    (_U_(0x1) << PMC_CSR2_PID70_Pos)                     /**< (PMC_CSR2) Peripheral Clock 70 Status Mask */
#define PMC_CSR2_PID70(value)                 (PMC_CSR2_PID70_Msk & ((value) << PMC_CSR2_PID70_Pos))
#define PMC_CSR2_PID71_Pos                    _U_(7)                                               /**< (PMC_CSR2) Peripheral Clock 71 Status Position */
#define PMC_CSR2_PID71_Msk                    (_U_(0x1) << PMC_CSR2_PID71_Pos)                     /**< (PMC_CSR2) Peripheral Clock 71 Status Mask */
#define PMC_CSR2_PID71(value)                 (PMC_CSR2_PID71_Msk & ((value) << PMC_CSR2_PID71_Pos))
#define PMC_CSR2_PID72_Pos                    _U_(8)                                               /**< (PMC_CSR2) Peripheral Clock 72 Status Position */
#define PMC_CSR2_PID72_Msk                    (_U_(0x1) << PMC_CSR2_PID72_Pos)                     /**< (PMC_CSR2) Peripheral Clock 72 Status Mask */
#define PMC_CSR2_PID72(value)                 (PMC_CSR2_PID72_Msk & ((value) << PMC_CSR2_PID72_Pos))
#define PMC_CSR2_PID73_Pos                    _U_(9)                                               /**< (PMC_CSR2) Peripheral Clock 73 Status Position */
#define PMC_CSR2_PID73_Msk                    (_U_(0x1) << PMC_CSR2_PID73_Pos)                     /**< (PMC_CSR2) Peripheral Clock 73 Status Mask */
#define PMC_CSR2_PID73(value)                 (PMC_CSR2_PID73_Msk & ((value) << PMC_CSR2_PID73_Pos))
#define PMC_CSR2_PID74_Pos                    _U_(10)                                              /**< (PMC_CSR2) Peripheral Clock 74 Status Position */
#define PMC_CSR2_PID74_Msk                    (_U_(0x1) << PMC_CSR2_PID74_Pos)                     /**< (PMC_CSR2) Peripheral Clock 74 Status Mask */
#define PMC_CSR2_PID74(value)                 (PMC_CSR2_PID74_Msk & ((value) << PMC_CSR2_PID74_Pos))
#define PMC_CSR2_PID75_Pos                    _U_(11)                                              /**< (PMC_CSR2) Peripheral Clock 75 Status Position */
#define PMC_CSR2_PID75_Msk                    (_U_(0x1) << PMC_CSR2_PID75_Pos)                     /**< (PMC_CSR2) Peripheral Clock 75 Status Mask */
#define PMC_CSR2_PID75(value)                 (PMC_CSR2_PID75_Msk & ((value) << PMC_CSR2_PID75_Pos))
#define PMC_CSR2_PID76_Pos                    _U_(12)                                              /**< (PMC_CSR2) Peripheral Clock 76 Status Position */
#define PMC_CSR2_PID76_Msk                    (_U_(0x1) << PMC_CSR2_PID76_Pos)                     /**< (PMC_CSR2) Peripheral Clock 76 Status Mask */
#define PMC_CSR2_PID76(value)                 (PMC_CSR2_PID76_Msk & ((value) << PMC_CSR2_PID76_Pos))
#define PMC_CSR2_PID77_Pos                    _U_(13)                                              /**< (PMC_CSR2) Peripheral Clock 77 Status Position */
#define PMC_CSR2_PID77_Msk                    (_U_(0x1) << PMC_CSR2_PID77_Pos)                     /**< (PMC_CSR2) Peripheral Clock 77 Status Mask */
#define PMC_CSR2_PID77(value)                 (PMC_CSR2_PID77_Msk & ((value) << PMC_CSR2_PID77_Pos))
#define PMC_CSR2_PID78_Pos                    _U_(14)                                              /**< (PMC_CSR2) Peripheral Clock 78 Status Position */
#define PMC_CSR2_PID78_Msk                    (_U_(0x1) << PMC_CSR2_PID78_Pos)                     /**< (PMC_CSR2) Peripheral Clock 78 Status Mask */
#define PMC_CSR2_PID78(value)                 (PMC_CSR2_PID78_Msk & ((value) << PMC_CSR2_PID78_Pos))
#define PMC_CSR2_PID79_Pos                    _U_(15)                                              /**< (PMC_CSR2) Peripheral Clock 79 Status Position */
#define PMC_CSR2_PID79_Msk                    (_U_(0x1) << PMC_CSR2_PID79_Pos)                     /**< (PMC_CSR2) Peripheral Clock 79 Status Mask */
#define PMC_CSR2_PID79(value)                 (PMC_CSR2_PID79_Msk & ((value) << PMC_CSR2_PID79_Pos))
#define PMC_CSR2_PID80_Pos                    _U_(16)                                              /**< (PMC_CSR2) Peripheral Clock 80 Status Position */
#define PMC_CSR2_PID80_Msk                    (_U_(0x1) << PMC_CSR2_PID80_Pos)                     /**< (PMC_CSR2) Peripheral Clock 80 Status Mask */
#define PMC_CSR2_PID80(value)                 (PMC_CSR2_PID80_Msk & ((value) << PMC_CSR2_PID80_Pos))
#define PMC_CSR2_PID81_Pos                    _U_(17)                                              /**< (PMC_CSR2) Peripheral Clock 81 Status Position */
#define PMC_CSR2_PID81_Msk                    (_U_(0x1) << PMC_CSR2_PID81_Pos)                     /**< (PMC_CSR2) Peripheral Clock 81 Status Mask */
#define PMC_CSR2_PID81(value)                 (PMC_CSR2_PID81_Msk & ((value) << PMC_CSR2_PID81_Pos))
#define PMC_CSR2_PID82_Pos                    _U_(18)                                              /**< (PMC_CSR2) Peripheral Clock 82 Status Position */
#define PMC_CSR2_PID82_Msk                    (_U_(0x1) << PMC_CSR2_PID82_Pos)                     /**< (PMC_CSR2) Peripheral Clock 82 Status Mask */
#define PMC_CSR2_PID82(value)                 (PMC_CSR2_PID82_Msk & ((value) << PMC_CSR2_PID82_Pos))
#define PMC_CSR2_PID83_Pos                    _U_(19)                                              /**< (PMC_CSR2) Peripheral Clock 83 Status Position */
#define PMC_CSR2_PID83_Msk                    (_U_(0x1) << PMC_CSR2_PID83_Pos)                     /**< (PMC_CSR2) Peripheral Clock 83 Status Mask */
#define PMC_CSR2_PID83(value)                 (PMC_CSR2_PID83_Msk & ((value) << PMC_CSR2_PID83_Pos))
#define PMC_CSR2_PID84_Pos                    _U_(20)                                              /**< (PMC_CSR2) Peripheral Clock 84 Status Position */
#define PMC_CSR2_PID84_Msk                    (_U_(0x1) << PMC_CSR2_PID84_Pos)                     /**< (PMC_CSR2) Peripheral Clock 84 Status Mask */
#define PMC_CSR2_PID84(value)                 (PMC_CSR2_PID84_Msk & ((value) << PMC_CSR2_PID84_Pos))
#define PMC_CSR2_PID85_Pos                    _U_(21)                                              /**< (PMC_CSR2) Peripheral Clock 85 Status Position */
#define PMC_CSR2_PID85_Msk                    (_U_(0x1) << PMC_CSR2_PID85_Pos)                     /**< (PMC_CSR2) Peripheral Clock 85 Status Mask */
#define PMC_CSR2_PID85(value)                 (PMC_CSR2_PID85_Msk & ((value) << PMC_CSR2_PID85_Pos))
#define PMC_CSR2_PID86_Pos                    _U_(22)                                              /**< (PMC_CSR2) Peripheral Clock 86 Status Position */
#define PMC_CSR2_PID86_Msk                    (_U_(0x1) << PMC_CSR2_PID86_Pos)                     /**< (PMC_CSR2) Peripheral Clock 86 Status Mask */
#define PMC_CSR2_PID86(value)                 (PMC_CSR2_PID86_Msk & ((value) << PMC_CSR2_PID86_Pos))
#define PMC_CSR2_PID87_Pos                    _U_(23)                                              /**< (PMC_CSR2) Peripheral Clock 87 Status Position */
#define PMC_CSR2_PID87_Msk                    (_U_(0x1) << PMC_CSR2_PID87_Pos)                     /**< (PMC_CSR2) Peripheral Clock 87 Status Mask */
#define PMC_CSR2_PID87(value)                 (PMC_CSR2_PID87_Msk & ((value) << PMC_CSR2_PID87_Pos))
#define PMC_CSR2_PID88_Pos                    _U_(24)                                              /**< (PMC_CSR2) Peripheral Clock 88 Status Position */
#define PMC_CSR2_PID88_Msk                    (_U_(0x1) << PMC_CSR2_PID88_Pos)                     /**< (PMC_CSR2) Peripheral Clock 88 Status Mask */
#define PMC_CSR2_PID88(value)                 (PMC_CSR2_PID88_Msk & ((value) << PMC_CSR2_PID88_Pos))
#define PMC_CSR2_PID89_Pos                    _U_(25)                                              /**< (PMC_CSR2) Peripheral Clock 89 Status Position */
#define PMC_CSR2_PID89_Msk                    (_U_(0x1) << PMC_CSR2_PID89_Pos)                     /**< (PMC_CSR2) Peripheral Clock 89 Status Mask */
#define PMC_CSR2_PID89(value)                 (PMC_CSR2_PID89_Msk & ((value) << PMC_CSR2_PID89_Pos))
#define PMC_CSR2_PID90_Pos                    _U_(26)                                              /**< (PMC_CSR2) Peripheral Clock 90 Status Position */
#define PMC_CSR2_PID90_Msk                    (_U_(0x1) << PMC_CSR2_PID90_Pos)                     /**< (PMC_CSR2) Peripheral Clock 90 Status Mask */
#define PMC_CSR2_PID90(value)                 (PMC_CSR2_PID90_Msk & ((value) << PMC_CSR2_PID90_Pos))
#define PMC_CSR2_PID91_Pos                    _U_(27)                                              /**< (PMC_CSR2) Peripheral Clock 91 Status Position */
#define PMC_CSR2_PID91_Msk                    (_U_(0x1) << PMC_CSR2_PID91_Pos)                     /**< (PMC_CSR2) Peripheral Clock 91 Status Mask */
#define PMC_CSR2_PID91(value)                 (PMC_CSR2_PID91_Msk & ((value) << PMC_CSR2_PID91_Pos))
#define PMC_CSR2_PID92_Pos                    _U_(28)                                              /**< (PMC_CSR2) Peripheral Clock 92 Status Position */
#define PMC_CSR2_PID92_Msk                    (_U_(0x1) << PMC_CSR2_PID92_Pos)                     /**< (PMC_CSR2) Peripheral Clock 92 Status Mask */
#define PMC_CSR2_PID92(value)                 (PMC_CSR2_PID92_Msk & ((value) << PMC_CSR2_PID92_Pos))
#define PMC_CSR2_PID93_Pos                    _U_(29)                                              /**< (PMC_CSR2) Peripheral Clock 93 Status Position */
#define PMC_CSR2_PID93_Msk                    (_U_(0x1) << PMC_CSR2_PID93_Pos)                     /**< (PMC_CSR2) Peripheral Clock 93 Status Mask */
#define PMC_CSR2_PID93(value)                 (PMC_CSR2_PID93_Msk & ((value) << PMC_CSR2_PID93_Pos))
#define PMC_CSR2_PID94_Pos                    _U_(30)                                              /**< (PMC_CSR2) Peripheral Clock 94 Status Position */
#define PMC_CSR2_PID94_Msk                    (_U_(0x1) << PMC_CSR2_PID94_Pos)                     /**< (PMC_CSR2) Peripheral Clock 94 Status Mask */
#define PMC_CSR2_PID94(value)                 (PMC_CSR2_PID94_Msk & ((value) << PMC_CSR2_PID94_Pos))
#define PMC_CSR2_PID95_Pos                    _U_(31)                                              /**< (PMC_CSR2) Peripheral Clock 95 Status Position */
#define PMC_CSR2_PID95_Msk                    (_U_(0x1) << PMC_CSR2_PID95_Pos)                     /**< (PMC_CSR2) Peripheral Clock 95 Status Mask */
#define PMC_CSR2_PID95(value)                 (PMC_CSR2_PID95_Msk & ((value) << PMC_CSR2_PID95_Pos))
#define PMC_CSR2_Msk                          _U_(0xFFFFFFFF)                                      /**< (PMC_CSR2) Register Mask  */

#define PMC_CSR2_PID_Pos                      _U_(0)                                               /**< (PMC_CSR2 Position) Peripheral Clock 95 Status */
#define PMC_CSR2_PID_Msk                      (_U_(0xFFFFFFFF) << PMC_CSR2_PID_Pos)                /**< (PMC_CSR2 Mask) PID */
#define PMC_CSR2_PID(value)                   (PMC_CSR2_PID_Msk & ((value) << PMC_CSR2_PID_Pos))   

