Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_CSR3 : (PMC Offset: 0x17C) ( R/ 32) Peripheral Clock Status Register 3 -------- */
#define PMC_CSR3_PID96_Pos                    _U_(0)                                               /**< (PMC_CSR3) Peripheral Clock 96 Status Position */
#define PMC_CSR3_PID96_Msk                    (_U_(0x1) << PMC_CSR3_PID96_Pos)                     /**< (PMC_CSR3) Peripheral Clock 96 Status Mask */
#define PMC_CSR3_PID96(value)                 (PMC_CSR3_PID96_Msk & ((value) << PMC_CSR3_PID96_Pos))
#define PMC_CSR3_PID97_Pos                    _U_(1)                                               /**< (PMC_CSR3) Peripheral Clock 97 Status Position */
#define PMC_CSR3_PID97_Msk                    (_U_(0x1) << PMC_CSR3_PID97_Pos)                     /**< (PMC_CSR3) Peripheral Clock 97 Status Mask */
#define PMC_CSR3_PID97(value)                 (PMC_CSR3_PID97_Msk & ((value) << PMC_CSR3_PID97_Pos))
#define PMC_CSR3_PID98_Pos                    _U_(2)                                               /**< (PMC_CSR3) Peripheral Clock 98 Status Position */
#define PMC_CSR3_PID98_Msk                    (_U_(0x1) << PMC_CSR3_PID98_Pos)                     /**< (PMC_CSR3) Peripheral Clock 98 Status Mask */
#define PMC_CSR3_PID98(value)                 (PMC_CSR3_PID98_Msk & ((value) << PMC_CSR3_PID98_Pos))
#define PMC_CSR3_PID99_Pos                    _U_(3)                                               /**< (PMC_CSR3) Peripheral Clock 99 Status Position */
#define PMC_CSR3_PID99_Msk                    (_U_(0x1) << PMC_CSR3_PID99_Pos)                     /**< (PMC_CSR3) Peripheral Clock 99 Status Mask */
#define PMC_CSR3_PID99(value)                 (PMC_CSR3_PID99_Msk & ((value) << PMC_CSR3_PID99_Pos))
#define PMC_CSR3_PID100_Pos                   _U_(4)                                               /**< (PMC_CSR3) Peripheral Clock 100 Status Position */
#define PMC_CSR3_PID100_Msk                   (_U_(0x1) << PMC_CSR3_PID100_Pos)                    /**< (PMC_CSR3) Peripheral Clock 100 Status Mask */
#define PMC_CSR3_PID100(value)                (PMC_CSR3_PID100_Msk & ((value) << PMC_CSR3_PID100_Pos))
#define PMC_CSR3_PID101_Pos                   _U_(5)                                               /**< (PMC_CSR3) Peripheral Clock 101 Status Position */
#define PMC_CSR3_PID101_Msk                   (_U_(0x1) << PMC_CSR3_PID101_Pos)                    /**< (PMC_CSR3) Peripheral Clock 101 Status Mask */
#define PMC_CSR3_PID101(value)                (PMC_CSR3_PID101_Msk & ((value) << PMC_CSR3_PID101_Pos))
#define PMC_CSR3_PID102_Pos                   _U_(6)                                               /**< (PMC_CSR3) Peripheral Clock 102 Status Position */
#define PMC_CSR3_PID102_Msk                   (_U_(0x1) << PMC_CSR3_PID102_Pos)                    /**< (PMC_CSR3) Peripheral Clock 102 Status Mask */
#define PMC_CSR3_PID102(value)                (PMC_CSR3_PID102_Msk & ((value) << PMC_CSR3_PID102_Pos))
#define PMC_CSR3_PID103_Pos                   _U_(7)                                               /**< (PMC_CSR3) Peripheral Clock 103 Status Position */
#define PMC_CSR3_PID103_Msk                   (_U_(0x1) << PMC_CSR3_PID103_Pos)                    /**< (PMC_CSR3) Peripheral Clock 103 Status Mask */
#define PMC_CSR3_PID103(value)                (PMC_CSR3_PID103_Msk & ((value) << PMC_CSR3_PID103_Pos))
#define PMC_CSR3_PID104_Pos                   _U_(8)                                               /**< (PMC_CSR3) Peripheral Clock 104 Status Position */
#define PMC_CSR3_PID104_Msk                   (_U_(0x1) << PMC_CSR3_PID104_Pos)                    /**< (PMC_CSR3) Peripheral Clock 104 Status Mask */
#define PMC_CSR3_PID104(value)                (PMC_CSR3_PID104_Msk & ((value) << PMC_CSR3_PID104_Pos))
#define PMC_CSR3_PID105_Pos                   _U_(9)                                               /**< (PMC_CSR3) Peripheral Clock 105 Status Position */
#define PMC_CSR3_PID105_Msk                   (_U_(0x1) << PMC_CSR3_PID105_Pos)                    /**< (PMC_CSR3) Peripheral Clock 105 Status Mask */
#define PMC_CSR3_PID105(value)                (PMC_CSR3_PID105_Msk & ((value) << PMC_CSR3_PID105_Pos))
#define PMC_CSR3_PID106_Pos                   _U_(10)                                              /**< (PMC_CSR3) Peripheral Clock 106 Status Position */
#define PMC_CSR3_PID106_Msk                   (_U_(0x1) << PMC_CSR3_PID106_Pos)                    /**< (PMC_CSR3) Peripheral Clock 106 Status Mask */
#define PMC_CSR3_PID106(value)                (PMC_CSR3_PID106_Msk & ((value) << PMC_CSR3_PID106_Pos))
#define PMC_CSR3_PID107_Pos                   _U_(11)                                              /**< (PMC_CSR3) Peripheral Clock 107 Status Position */
#define PMC_CSR3_PID107_Msk                   (_U_(0x1) << PMC_CSR3_PID107_Pos)                    /**< (PMC_CSR3) Peripheral Clock 107 Status Mask */
#define PMC_CSR3_PID107(value)                (PMC_CSR3_PID107_Msk & ((value) << PMC_CSR3_PID107_Pos))
#define PMC_CSR3_PID108_Pos                   _U_(12)                                              /**< (PMC_CSR3) Peripheral Clock 108 Status Position */
#define PMC_CSR3_PID108_Msk                   (_U_(0x1) << PMC_CSR3_PID108_Pos)                    /**< (PMC_CSR3) Peripheral Clock 108 Status Mask */
#define PMC_CSR3_PID108(value)                (PMC_CSR3_PID108_Msk & ((value) << PMC_CSR3_PID108_Pos))
#define PMC_CSR3_PID109_Pos                   _U_(13)                                              /**< (PMC_CSR3) Peripheral Clock 109 Status Position */
#define PMC_CSR3_PID109_Msk                   (_U_(0x1) << PMC_CSR3_PID109_Pos)                    /**< (PMC_CSR3) Peripheral Clock 109 Status Mask */
#define PMC_CSR3_PID109(value)                (PMC_CSR3_PID109_Msk & ((value) << PMC_CSR3_PID109_Pos))
#define PMC_CSR3_PID110_Pos                   _U_(14)                                              /**< (PMC_CSR3) Peripheral Clock 110 Status Position */
#define PMC_CSR3_PID110_Msk                   (_U_(0x1) << PMC_CSR3_PID110_Pos)                    /**< (PMC_CSR3) Peripheral Clock 110 Status Mask */
#define PMC_CSR3_PID110(value)                (PMC_CSR3_PID110_Msk & ((value) << PMC_CSR3_PID110_Pos))
#define PMC_CSR3_PID111_Pos                   _U_(15)                                              /**< (PMC_CSR3) Peripheral Clock 111 Status Position */
#define PMC_CSR3_PID111_Msk                   (_U_(0x1) << PMC_CSR3_PID111_Pos)                    /**< (PMC_CSR3) Peripheral Clock 111 Status Mask */
#define PMC_CSR3_PID111(value)                (PMC_CSR3_PID111_Msk & ((value) << PMC_CSR3_PID111_Pos))
#define PMC_CSR3_PID112_Pos                   _U_(16)                                              /**< (PMC_CSR3) Peripheral Clock 112 Status Position */
#define PMC_CSR3_PID112_Msk                   (_U_(0x1) << PMC_CSR3_PID112_Pos)                    /**< (PMC_CSR3) Peripheral Clock 112 Status Mask */
#define PMC_CSR3_PID112(value)                (PMC_CSR3_PID112_Msk & ((value) << PMC_CSR3_PID112_Pos))
#define PMC_CSR3_PID113_Pos                   _U_(17)                                              /**< (PMC_CSR3) Peripheral Clock 113 Status Position */
#define PMC_CSR3_PID113_Msk                   (_U_(0x1) << PMC_CSR3_PID113_Pos)                    /**< (PMC_CSR3) Peripheral Clock 113 Status Mask */
#define PMC_CSR3_PID113(value)                (PMC_CSR3_PID113_Msk & ((value) << PMC_CSR3_PID113_Pos))
#define PMC_CSR3_PID114_Pos                   _U_(18)                                              /**< (PMC_CSR3) Peripheral Clock 114 Status Position */
#define PMC_CSR3_PID114_Msk                   (_U_(0x1) << PMC_CSR3_PID114_Pos)                    /**< (PMC_CSR3) Peripheral Clock 114 Status Mask */
#define PMC_CSR3_PID114(value)                (PMC_CSR3_PID114_Msk & ((value) << PMC_CSR3_PID114_Pos))
#define PMC_CSR3_PID115_Pos                   _U_(19)                                              /**< (PMC_CSR3) Peripheral Clock 115 Status Position */
#define PMC_CSR3_PID115_Msk                   (_U_(0x1) << PMC_CSR3_PID115_Pos)                    /**< (PMC_CSR3) Peripheral Clock 115 Status Mask */
#define PMC_CSR3_PID115(value)                (PMC_CSR3_PID115_Msk & ((value) << PMC_CSR3_PID115_Pos))
#define PMC_CSR3_PID116_Pos                   _U_(20)                                              /**< (PMC_CSR3) Peripheral Clock 116 Status Position */
#define PMC_CSR3_PID116_Msk                   (_U_(0x1) << PMC_CSR3_PID116_Pos)                    /**< (PMC_CSR3) Peripheral Clock 116 Status Mask */
#define PMC_CSR3_PID116(value)                (PMC_CSR3_PID116_Msk & ((value) << PMC_CSR3_PID116_Pos))
#define PMC_CSR3_PID117_Pos                   _U_(21)                                              /**< (PMC_CSR3) Peripheral Clock 117 Status Position */
#define PMC_CSR3_PID117_Msk                   (_U_(0x1) << PMC_CSR3_PID117_Pos)                    /**< (PMC_CSR3) Peripheral Clock 117 Status Mask */
#define PMC_CSR3_PID117(value)                (PMC_CSR3_PID117_Msk & ((value) << PMC_CSR3_PID117_Pos))
#define PMC_CSR3_PID118_Pos                   _U_(22)                                              /**< (PMC_CSR3) Peripheral Clock 118 Status Position */
#define PMC_CSR3_PID118_Msk                   (_U_(0x1) << PMC_CSR3_PID118_Pos)                    /**< (PMC_CSR3) Peripheral Clock 118 Status Mask */
#define PMC_CSR3_PID118(value)                (PMC_CSR3_PID118_Msk & ((value) << PMC_CSR3_PID118_Pos))
#define PMC_CSR3_PID119_Pos                   _U_(23)                                              /**< (PMC_CSR3) Peripheral Clock 119 Status Position */
#define PMC_CSR3_PID119_Msk                   (_U_(0x1) << PMC_CSR3_PID119_Pos)                    /**< (PMC_CSR3) Peripheral Clock 119 Status Mask */
#define PMC_CSR3_PID119(value)                (PMC_CSR3_PID119_Msk & ((value) << PMC_CSR3_PID119_Pos))
#define PMC_CSR3_PID120_Pos                   _U_(24)                                              /**< (PMC_CSR3) Peripheral Clock 120 Status Position */
#define PMC_CSR3_PID120_Msk                   (_U_(0x1) << PMC_CSR3_PID120_Pos)                    /**< (PMC_CSR3) Peripheral Clock 120 Status Mask */
#define PMC_CSR3_PID120(value)                (PMC_CSR3_PID120_Msk & ((value) << PMC_CSR3_PID120_Pos))
#define PMC_CSR3_PID121_Pos                   _U_(25)                                              /**< (PMC_CSR3) Peripheral Clock 121 Status Position */
#define PMC_CSR3_PID121_Msk                   (_U_(0x1) << PMC_CSR3_PID121_Pos)                    /**< (PMC_CSR3) Peripheral Clock 121 Status Mask */
#define PMC_CSR3_PID121(value)                (PMC_CSR3_PID121_Msk & ((value) << PMC_CSR3_PID121_Pos))
#define PMC_CSR3_PID122_Pos                   _U_(26)                                              /**< (PMC_CSR3) Peripheral Clock 122 Status Position */
#define PMC_CSR3_PID122_Msk                   (_U_(0x1) << PMC_CSR3_PID122_Pos)                    /**< (PMC_CSR3) Peripheral Clock 122 Status Mask */
#define PMC_CSR3_PID122(value)                (PMC_CSR3_PID122_Msk & ((value) << PMC_CSR3_PID122_Pos))
#define PMC_CSR3_PID123_Pos                   _U_(27)                                              /**< (PMC_CSR3) Peripheral Clock 123 Status Position */
#define PMC_CSR3_PID123_Msk                   (_U_(0x1) << PMC_CSR3_PID123_Pos)                    /**< (PMC_CSR3) Peripheral Clock 123 Status Mask */
#define PMC_CSR3_PID123(value)                (PMC_CSR3_PID123_Msk & ((value) << PMC_CSR3_PID123_Pos))
#define PMC_CSR3_PID124_Pos                   _U_(28)                                              /**< (PMC_CSR3) Peripheral Clock 124 Status Position */
#define PMC_CSR3_PID124_Msk                   (_U_(0x1) << PMC_CSR3_PID124_Pos)                    /**< (PMC_CSR3) Peripheral Clock 124 Status Mask */
#define PMC_CSR3_PID124(value)                (PMC_CSR3_PID124_Msk & ((value) << PMC_CSR3_PID124_Pos))
#define PMC_CSR3_PID125_Pos                   _U_(29)                                              /**< (PMC_CSR3) Peripheral Clock 125 Status Position */
#define PMC_CSR3_PID125_Msk                   (_U_(0x1) << PMC_CSR3_PID125_Pos)                    /**< (PMC_CSR3) Peripheral Clock 125 Status Mask */
#define PMC_CSR3_PID125(value)                (PMC_CSR3_PID125_Msk & ((value) << PMC_CSR3_PID125_Pos))
#define PMC_CSR3_PID126_Pos                   _U_(30)                                              /**< (PMC_CSR3) Peripheral Clock 126 Status Position */
#define PMC_CSR3_PID126_Msk                   (_U_(0x1) << PMC_CSR3_PID126_Pos)                    /**< (PMC_CSR3) Peripheral Clock 126 Status Mask */
#define PMC_CSR3_PID126(value)                (PMC_CSR3_PID126_Msk & ((value) << PMC_CSR3_PID126_Pos))
#define PMC_CSR3_PID127_Pos                   _U_(31)                                              /**< (PMC_CSR3) Peripheral Clock 127 Status Position */
#define PMC_CSR3_PID127_Msk                   (_U_(0x1) << PMC_CSR3_PID127_Pos)                    /**< (PMC_CSR3) Peripheral Clock 127 Status Mask */
#define PMC_CSR3_PID127(value)                (PMC_CSR3_PID127_Msk & ((value) << PMC_CSR3_PID127_Pos))
#define PMC_CSR3_Msk                          _U_(0xFFFFFFFF)                                      /**< (PMC_CSR3) Register Mask  */

#define PMC_CSR3_PID_Pos                      _U_(0)                                               /**< (PMC_CSR3 Position) Peripheral Clock x27 Status */
#define PMC_CSR3_PID_Msk                      (_U_(0xFFFFFFFF) << PMC_CSR3_PID_Pos)                /**< (PMC_CSR3 Mask) PID */
#define PMC_CSR3_PID(value)                   (PMC_CSR3_PID_Msk & ((value) << PMC_CSR3_PID_Pos))   

