Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_GCSR1 : (PMC Offset: 0x194) ( R/ 32) Generic Clock Status Register 1 -------- */
#define PMC_GCSR1_GPID32_Pos                  _U_(0)                                               /**< (PMC_GCSR1) Generic Clock 32 Status Position */
#define PMC_GCSR1_GPID32_Msk                  (_U_(0x1) << PMC_GCSR1_GPID32_Pos)                   /**< (PMC_GCSR1) Generic Clock 32 Status Mask */
#define PMC_GCSR1_GPID32(value)               (PMC_GCSR1_GPID32_Msk & ((value) << PMC_GCSR1_GPID32_Pos))
#define PMC_GCSR1_GPID33_Pos                  _U_(1)                                               /**< (PMC_GCSR1) Generic Clock 33 Status Position */
#define PMC_GCSR1_GPID33_Msk                  (_U_(0x1) << PMC_GCSR1_GPID33_Pos)                   /**< (PMC_GCSR1) Generic Clock 33 Status Mask */
#define PMC_GCSR1_GPID33(value)               (PMC_GCSR1_GPID33_Msk & ((value) << PMC_GCSR1_GPID33_Pos))
#define PMC_GCSR1_GPID34_Pos                  _U_(2)                                               /**< (PMC_GCSR1) Generic Clock 34 Status Position */
#define PMC_GCSR1_GPID34_Msk                  (_U_(0x1) << PMC_GCSR1_GPID34_Pos)                   /**< (PMC_GCSR1) Generic Clock 34 Status Mask */
#define PMC_GCSR1_GPID34(value)               (PMC_GCSR1_GPID34_Msk & ((value) << PMC_GCSR1_GPID34_Pos))
#define PMC_GCSR1_GPID35_Pos                  _U_(3)                                               /**< (PMC_GCSR1) Generic Clock 35 Status Position */
#define PMC_GCSR1_GPID35_Msk                  (_U_(0x1) << PMC_GCSR1_GPID35_Pos)                   /**< (PMC_GCSR1) Generic Clock 35 Status Mask */
#define PMC_GCSR1_GPID35(value)               (PMC_GCSR1_GPID35_Msk & ((value) << PMC_GCSR1_GPID35_Pos))
#define PMC_GCSR1_GPID36_Pos                  _U_(4)                                               /**< (PMC_GCSR1) Generic Clock 36 Status Position */
#define PMC_GCSR1_GPID36_Msk                  (_U_(0x1) << PMC_GCSR1_GPID36_Pos)                   /**< (PMC_GCSR1) Generic Clock 36 Status Mask */
#define PMC_GCSR1_GPID36(value)               (PMC_GCSR1_GPID36_Msk & ((value) << PMC_GCSR1_GPID36_Pos))
#define PMC_GCSR1_GPID37_Pos                  _U_(5)                                               /**< (PMC_GCSR1) Generic Clock 37 Status Position */
#define PMC_GCSR1_GPID37_Msk                  (_U_(0x1) << PMC_GCSR1_GPID37_Pos)                   /**< (PMC_GCSR1) Generic Clock 37 Status Mask */
#define PMC_GCSR1_GPID37(value)               (PMC_GCSR1_GPID37_Msk & ((value) << PMC_GCSR1_GPID37_Pos))
#define PMC_GCSR1_GPID38_Pos                  _U_(6)                                               /**< (PMC_GCSR1) Generic Clock 38 Status Position */
#define PMC_GCSR1_GPID38_Msk                  (_U_(0x1) << PMC_GCSR1_GPID38_Pos)                   /**< (PMC_GCSR1) Generic Clock 38 Status Mask */
#define PMC_GCSR1_GPID38(value)               (PMC_GCSR1_GPID38_Msk & ((value) << PMC_GCSR1_GPID38_Pos))
#define PMC_GCSR1_GPID39_Pos                  _U_(7)                                               /**< (PMC_GCSR1) Generic Clock 39 Status Position */
#define PMC_GCSR1_GPID39_Msk                  (_U_(0x1) << PMC_GCSR1_GPID39_Pos)                   /**< (PMC_GCSR1) Generic Clock 39 Status Mask */
#define PMC_GCSR1_GPID39(value)               (PMC_GCSR1_GPID39_Msk & ((value) << PMC_GCSR1_GPID39_Pos))
#define PMC_GCSR1_GPID40_Pos                  _U_(8)                                               /**< (PMC_GCSR1) Generic Clock 40 Status Position */
#define PMC_GCSR1_GPID40_Msk                  (_U_(0x1) << PMC_GCSR1_GPID40_Pos)                   /**< (PMC_GCSR1) Generic Clock 40 Status Mask */
#define PMC_GCSR1_GPID40(value)               (PMC_GCSR1_GPID40_Msk & ((value) << PMC_GCSR1_GPID40_Pos))
#define PMC_GCSR1_GPID41_Pos                  _U_(9)                                               /**< (PMC_GCSR1) Generic Clock 41 Status Position */
#define PMC_GCSR1_GPID41_Msk                  (_U_(0x1) << PMC_GCSR1_GPID41_Pos)                   /**< (PMC_GCSR1) Generic Clock 41 Status Mask */
#define PMC_GCSR1_GPID41(value)               (PMC_GCSR1_GPID41_Msk & ((value) << PMC_GCSR1_GPID41_Pos))
#define PMC_GCSR1_GPID42_Pos                  _U_(10)                                              /**< (PMC_GCSR1) Generic Clock 42 Status Position */
#define PMC_GCSR1_GPID42_Msk                  (_U_(0x1) << PMC_GCSR1_GPID42_Pos)                   /**< (PMC_GCSR1) Generic Clock 42 Status Mask */
#define PMC_GCSR1_GPID42(value)               (PMC_GCSR1_GPID42_Msk & ((value) << PMC_GCSR1_GPID42_Pos))
#define PMC_GCSR1_GPID43_Pos                  _U_(11)                                              /**< (PMC_GCSR1) Generic Clock 43 Status Position */
#define PMC_GCSR1_GPID43_Msk                  (_U_(0x1) << PMC_GCSR1_GPID43_Pos)                   /**< (PMC_GCSR1) Generic Clock 43 Status Mask */
#define PMC_GCSR1_GPID43(value)               (PMC_GCSR1_GPID43_Msk & ((value) << PMC_GCSR1_GPID43_Pos))
#define PMC_GCSR1_GPID44_Pos                  _U_(12)                                              /**< (PMC_GCSR1) Generic Clock 44 Status Position */
#define PMC_GCSR1_GPID44_Msk                  (_U_(0x1) << PMC_GCSR1_GPID44_Pos)                   /**< (PMC_GCSR1) Generic Clock 44 Status Mask */
#define PMC_GCSR1_GPID44(value)               (PMC_GCSR1_GPID44_Msk & ((value) << PMC_GCSR1_GPID44_Pos))
#define PMC_GCSR1_GPID45_Pos                  _U_(13)                                              /**< (PMC_GCSR1) Generic Clock 45 Status Position */
#define PMC_GCSR1_GPID45_Msk                  (_U_(0x1) << PMC_GCSR1_GPID45_Pos)                   /**< (PMC_GCSR1) Generic Clock 45 Status Mask */
#define PMC_GCSR1_GPID45(value)               (PMC_GCSR1_GPID45_Msk & ((value) << PMC_GCSR1_GPID45_Pos))
#define PMC_GCSR1_GPID46_Pos                  _U_(14)                                              /**< (PMC_GCSR1) Generic Clock 46 Status Position */
#define PMC_GCSR1_GPID46_Msk                  (_U_(0x1) << PMC_GCSR1_GPID46_Pos)                   /**< (PMC_GCSR1) Generic Clock 46 Status Mask */
#define PMC_GCSR1_GPID46(value)               (PMC_GCSR1_GPID46_Msk & ((value) << PMC_GCSR1_GPID46_Pos))
#define PMC_GCSR1_GPID47_Pos                  _U_(15)                                              /**< (PMC_GCSR1) Generic Clock 47 Status Position */
#define PMC_GCSR1_GPID47_Msk                  (_U_(0x1) << PMC_GCSR1_GPID47_Pos)                   /**< (PMC_GCSR1) Generic Clock 47 Status Mask */
#define PMC_GCSR1_GPID47(value)               (PMC_GCSR1_GPID47_Msk & ((value) << PMC_GCSR1_GPID47_Pos))
#define PMC_GCSR1_GPID48_Pos                  _U_(16)                                              /**< (PMC_GCSR1) Generic Clock 48 Status Position */
#define PMC_GCSR1_GPID48_Msk                  (_U_(0x1) << PMC_GCSR1_GPID48_Pos)                   /**< (PMC_GCSR1) Generic Clock 48 Status Mask */
#define PMC_GCSR1_GPID48(value)               (PMC_GCSR1_GPID48_Msk & ((value) << PMC_GCSR1_GPID48_Pos))
#define PMC_GCSR1_GPID49_Pos                  _U_(17)                                              /**< (PMC_GCSR1) Generic Clock 49 Status Position */
#define PMC_GCSR1_GPID49_Msk                  (_U_(0x1) << PMC_GCSR1_GPID49_Pos)                   /**< (PMC_GCSR1) Generic Clock 49 Status Mask */
#define PMC_GCSR1_GPID49(value)               (PMC_GCSR1_GPID49_Msk & ((value) << PMC_GCSR1_GPID49_Pos))
#define PMC_GCSR1_GPID50_Pos                  _U_(18)                                              /**< (PMC_GCSR1) Generic Clock 50 Status Position */
#define PMC_GCSR1_GPID50_Msk                  (_U_(0x1) << PMC_GCSR1_GPID50_Pos)                   /**< (PMC_GCSR1) Generic Clock 50 Status Mask */
#define PMC_GCSR1_GPID50(value)               (PMC_GCSR1_GPID50_Msk & ((value) << PMC_GCSR1_GPID50_Pos))
#define PMC_GCSR1_GPID51_Pos                  _U_(19)                                              /**< (PMC_GCSR1) Generic Clock 51 Status Position */
#define PMC_GCSR1_GPID51_Msk                  (_U_(0x1) << PMC_GCSR1_GPID51_Pos)                   /**< (PMC_GCSR1) Generic Clock 51 Status Mask */
#define PMC_GCSR1_GPID51(value)               (PMC_GCSR1_GPID51_Msk & ((value) << PMC_GCSR1_GPID51_Pos))
#define PMC_GCSR1_GPID52_Pos                  _U_(20)                                              /**< (PMC_GCSR1) Generic Clock 52 Status Position */
#define PMC_GCSR1_GPID52_Msk                  (_U_(0x1) << PMC_GCSR1_GPID52_Pos)                   /**< (PMC_GCSR1) Generic Clock 52 Status Mask */
#define PMC_GCSR1_GPID52(value)               (PMC_GCSR1_GPID52_Msk & ((value) << PMC_GCSR1_GPID52_Pos))
#define PMC_GCSR1_GPID53_Pos                  _U_(21)                                              /**< (PMC_GCSR1) Generic Clock 53 Status Position */
#define PMC_GCSR1_GPID53_Msk                  (_U_(0x1) << PMC_GCSR1_GPID53_Pos)                   /**< (PMC_GCSR1) Generic Clock 53 Status Mask */
#define PMC_GCSR1_GPID53(value)               (PMC_GCSR1_GPID53_Msk & ((value) << PMC_GCSR1_GPID53_Pos))
#define PMC_GCSR1_GPID54_Pos                  _U_(22)                                              /**< (PMC_GCSR1) Generic Clock 54 Status Position */
#define PMC_GCSR1_GPID54_Msk                  (_U_(0x1) << PMC_GCSR1_GPID54_Pos)                   /**< (PMC_GCSR1) Generic Clock 54 Status Mask */
#define PMC_GCSR1_GPID54(value)               (PMC_GCSR1_GPID54_Msk & ((value) << PMC_GCSR1_GPID54_Pos))
#define PMC_GCSR1_GPID55_Pos                  _U_(23)                                              /**< (PMC_GCSR1) Generic Clock 55 Status Position */
#define PMC_GCSR1_GPID55_Msk                  (_U_(0x1) << PMC_GCSR1_GPID55_Pos)                   /**< (PMC_GCSR1) Generic Clock 55 Status Mask */
#define PMC_GCSR1_GPID55(value)               (PMC_GCSR1_GPID55_Msk & ((value) << PMC_GCSR1_GPID55_Pos))
#define PMC_GCSR1_GPID56_Pos                  _U_(24)                                              /**< (PMC_GCSR1) Generic Clock 56 Status Position */
#define PMC_GCSR1_GPID56_Msk                  (_U_(0x1) << PMC_GCSR1_GPID56_Pos)                   /**< (PMC_GCSR1) Generic Clock 56 Status Mask */
#define PMC_GCSR1_GPID56(value)               (PMC_GCSR1_GPID56_Msk & ((value) << PMC_GCSR1_GPID56_Pos))
#define PMC_GCSR1_GPID57_Pos                  _U_(25)                                              /**< (PMC_GCSR1) Generic Clock 57 Status Position */
#define PMC_GCSR1_GPID57_Msk                  (_U_(0x1) << PMC_GCSR1_GPID57_Pos)                   /**< (PMC_GCSR1) Generic Clock 57 Status Mask */
#define PMC_GCSR1_GPID57(value)               (PMC_GCSR1_GPID57_Msk & ((value) << PMC_GCSR1_GPID57_Pos))
#define PMC_GCSR1_GPID58_Pos                  _U_(26)                                              /**< (PMC_GCSR1) Generic Clock 58 Status Position */
#define PMC_GCSR1_GPID58_Msk                  (_U_(0x1) << PMC_GCSR1_GPID58_Pos)                   /**< (PMC_GCSR1) Generic Clock 58 Status Mask */
#define PMC_GCSR1_GPID58(value)               (PMC_GCSR1_GPID58_Msk & ((value) << PMC_GCSR1_GPID58_Pos))
#define PMC_GCSR1_GPID59_Pos                  _U_(27)                                              /**< (PMC_GCSR1) Generic Clock 59 Status Position */
#define PMC_GCSR1_GPID59_Msk                  (_U_(0x1) << PMC_GCSR1_GPID59_Pos)                   /**< (PMC_GCSR1) Generic Clock 59 Status Mask */
#define PMC_GCSR1_GPID59(value)               (PMC_GCSR1_GPID59_Msk & ((value) << PMC_GCSR1_GPID59_Pos))
#define PMC_GCSR1_GPID60_Pos                  _U_(28)                                              /**< (PMC_GCSR1) Generic Clock 60 Status Position */
#define PMC_GCSR1_GPID60_Msk                  (_U_(0x1) << PMC_GCSR1_GPID60_Pos)                   /**< (PMC_GCSR1) Generic Clock 60 Status Mask */
#define PMC_GCSR1_GPID60(value)               (PMC_GCSR1_GPID60_Msk & ((value) << PMC_GCSR1_GPID60_Pos))
#define PMC_GCSR1_GPID61_Pos                  _U_(29)                                              /**< (PMC_GCSR1) Generic Clock 61 Status Position */
#define PMC_GCSR1_GPID61_Msk                  (_U_(0x1) << PMC_GCSR1_GPID61_Pos)                   /**< (PMC_GCSR1) Generic Clock 61 Status Mask */
#define PMC_GCSR1_GPID61(value)               (PMC_GCSR1_GPID61_Msk & ((value) << PMC_GCSR1_GPID61_Pos))
#define PMC_GCSR1_GPID62_Pos                  _U_(30)                                              /**< (PMC_GCSR1) Generic Clock 62 Status Position */
#define PMC_GCSR1_GPID62_Msk                  (_U_(0x1) << PMC_GCSR1_GPID62_Pos)                   /**< (PMC_GCSR1) Generic Clock 62 Status Mask */
#define PMC_GCSR1_GPID62(value)               (PMC_GCSR1_GPID62_Msk & ((value) << PMC_GCSR1_GPID62_Pos))
#define PMC_GCSR1_GPID63_Pos                  _U_(31)                                              /**< (PMC_GCSR1) Generic Clock 63 Status Position */
#define PMC_GCSR1_GPID63_Msk                  (_U_(0x1) << PMC_GCSR1_GPID63_Pos)                   /**< (PMC_GCSR1) Generic Clock 63 Status Mask */
#define PMC_GCSR1_GPID63(value)               (PMC_GCSR1_GPID63_Msk & ((value) << PMC_GCSR1_GPID63_Pos))
#define PMC_GCSR1_Msk                         _U_(0xFFFFFFFF)                                      /**< (PMC_GCSR1) Register Mask  */

