Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
#define PMC_GCSR1_GPID_Pos                    _U_(0)                                               /**< (PMC_GCSR1 Position) Generic Clock 63 Status */
#define PMC_GCSR1_GPID_Msk                    (_U_(0xFFFFFFFF) << PMC_GCSR1_GPID_Pos)              /**< (PMC_GCSR1 Mask) GPID */
#define PMC_GCSR1_GPID(value)                 (PMC_GCSR1_GPID_Msk & ((value) << PMC_GCSR1_GPID_Pos)) 

/* -------- PMC_GCSR2 : (PMC Offset: 0x198) ( R/ 32) Generic Clock Status Register 2 -------- */
#define PMC_GCSR2_GPID64_Pos                  _U_(0)                                               /**< (PMC_GCSR2) Generic Clock 64 Status Position */
#define PMC_GCSR2_GPID64_Msk                  (_U_(0x1) << PMC_GCSR2_GPID64_Pos)                   /**< (PMC_GCSR2) Generic Clock 64 Status Mask */
#define PMC_GCSR2_GPID64(value)               (PMC_GCSR2_GPID64_Msk & ((value) << PMC_GCSR2_GPID64_Pos))
#define PMC_GCSR2_GPID65_Pos                  _U_(1)                                               /**< (PMC_GCSR2) Generic Clock 65 Status Position */
#define PMC_GCSR2_GPID65_Msk                  (_U_(0x1) << PMC_GCSR2_GPID65_Pos)                   /**< (PMC_GCSR2) Generic Clock 65 Status Mask */
#define PMC_GCSR2_GPID65(value)               (PMC_GCSR2_GPID65_Msk & ((value) << PMC_GCSR2_GPID65_Pos))
#define PMC_GCSR2_GPID66_Pos                  _U_(2)                                               /**< (PMC_GCSR2) Generic Clock 66 Status Position */
#define PMC_GCSR2_GPID66_Msk                  (_U_(0x1) << PMC_GCSR2_GPID66_Pos)                   /**< (PMC_GCSR2) Generic Clock 66 Status Mask */
#define PMC_GCSR2_GPID66(value)               (PMC_GCSR2_GPID66_Msk & ((value) << PMC_GCSR2_GPID66_Pos))
#define PMC_GCSR2_GPID67_Pos                  _U_(3)                                               /**< (PMC_GCSR2) Generic Clock 67 Status Position */
#define PMC_GCSR2_GPID67_Msk                  (_U_(0x1) << PMC_GCSR2_GPID67_Pos)                   /**< (PMC_GCSR2) Generic Clock 67 Status Mask */
#define PMC_GCSR2_GPID67(value)               (PMC_GCSR2_GPID67_Msk & ((value) << PMC_GCSR2_GPID67_Pos))
#define PMC_GCSR2_GPID68_Pos                  _U_(4)                                               /**< (PMC_GCSR2) Generic Clock 68 Status Position */
#define PMC_GCSR2_GPID68_Msk                  (_U_(0x1) << PMC_GCSR2_GPID68_Pos)                   /**< (PMC_GCSR2) Generic Clock 68 Status Mask */
#define PMC_GCSR2_GPID68(value)               (PMC_GCSR2_GPID68_Msk & ((value) << PMC_GCSR2_GPID68_Pos))
#define PMC_GCSR2_GPID69_Pos                  _U_(5)                                               /**< (PMC_GCSR2) Generic Clock 69 Status Position */
#define PMC_GCSR2_GPID69_Msk                  (_U_(0x1) << PMC_GCSR2_GPID69_Pos)                   /**< (PMC_GCSR2) Generic Clock 69 Status Mask */
#define PMC_GCSR2_GPID69(value)               (PMC_GCSR2_GPID69_Msk & ((value) << PMC_GCSR2_GPID69_Pos))
#define PMC_GCSR2_GPID70_Pos                  _U_(6)                                               /**< (PMC_GCSR2) Generic Clock 70 Status Position */
#define PMC_GCSR2_GPID70_Msk                  (_U_(0x1) << PMC_GCSR2_GPID70_Pos)                   /**< (PMC_GCSR2) Generic Clock 70 Status Mask */
#define PMC_GCSR2_GPID70(value)               (PMC_GCSR2_GPID70_Msk & ((value) << PMC_GCSR2_GPID70_Pos))
#define PMC_GCSR2_GPID71_Pos                  _U_(7)                                               /**< (PMC_GCSR2) Generic Clock 71 Status Position */
#define PMC_GCSR2_GPID71_Msk                  (_U_(0x1) << PMC_GCSR2_GPID71_Pos)                   /**< (PMC_GCSR2) Generic Clock 71 Status Mask */
#define PMC_GCSR2_GPID71(value)               (PMC_GCSR2_GPID71_Msk & ((value) << PMC_GCSR2_GPID71_Pos))
#define PMC_GCSR2_GPID72_Pos                  _U_(8)                                               /**< (PMC_GCSR2) Generic Clock 72 Status Position */
#define PMC_GCSR2_GPID72_Msk                  (_U_(0x1) << PMC_GCSR2_GPID72_Pos)                   /**< (PMC_GCSR2) Generic Clock 72 Status Mask */
#define PMC_GCSR2_GPID72(value)               (PMC_GCSR2_GPID72_Msk & ((value) << PMC_GCSR2_GPID72_Pos))
#define PMC_GCSR2_GPID73_Pos                  _U_(9)                                               /**< (PMC_GCSR2) Generic Clock 73 Status Position */
#define PMC_GCSR2_GPID73_Msk                  (_U_(0x1) << PMC_GCSR2_GPID73_Pos)                   /**< (PMC_GCSR2) Generic Clock 73 Status Mask */
#define PMC_GCSR2_GPID73(value)               (PMC_GCSR2_GPID73_Msk & ((value) << PMC_GCSR2_GPID73_Pos))
#define PMC_GCSR2_GPID74_Pos                  _U_(10)                                              /**< (PMC_GCSR2) Generic Clock 74 Status Position */
#define PMC_GCSR2_GPID74_Msk                  (_U_(0x1) << PMC_GCSR2_GPID74_Pos)                   /**< (PMC_GCSR2) Generic Clock 74 Status Mask */
#define PMC_GCSR2_GPID74(value)               (PMC_GCSR2_GPID74_Msk & ((value) << PMC_GCSR2_GPID74_Pos))
#define PMC_GCSR2_GPID75_Pos                  _U_(11)                                              /**< (PMC_GCSR2) Generic Clock 75 Status Position */
#define PMC_GCSR2_GPID75_Msk                  (_U_(0x1) << PMC_GCSR2_GPID75_Pos)                   /**< (PMC_GCSR2) Generic Clock 75 Status Mask */
#define PMC_GCSR2_GPID75(value)               (PMC_GCSR2_GPID75_Msk & ((value) << PMC_GCSR2_GPID75_Pos))
#define PMC_GCSR2_GPID76_Pos                  _U_(12)                                              /**< (PMC_GCSR2) Generic Clock 76 Status Position */
#define PMC_GCSR2_GPID76_Msk                  (_U_(0x1) << PMC_GCSR2_GPID76_Pos)                   /**< (PMC_GCSR2) Generic Clock 76 Status Mask */
#define PMC_GCSR2_GPID76(value)               (PMC_GCSR2_GPID76_Msk & ((value) << PMC_GCSR2_GPID76_Pos))
#define PMC_GCSR2_GPID77_Pos                  _U_(13)                                              /**< (PMC_GCSR2) Generic Clock 77 Status Position */
#define PMC_GCSR2_GPID77_Msk                  (_U_(0x1) << PMC_GCSR2_GPID77_Pos)                   /**< (PMC_GCSR2) Generic Clock 77 Status Mask */
#define PMC_GCSR2_GPID77(value)               (PMC_GCSR2_GPID77_Msk & ((value) << PMC_GCSR2_GPID77_Pos))
#define PMC_GCSR2_GPID78_Pos                  _U_(14)                                              /**< (PMC_GCSR2) Generic Clock 78 Status Position */
#define PMC_GCSR2_GPID78_Msk                  (_U_(0x1) << PMC_GCSR2_GPID78_Pos)                   /**< (PMC_GCSR2) Generic Clock 78 Status Mask */
#define PMC_GCSR2_GPID78(value)               (PMC_GCSR2_GPID78_Msk & ((value) << PMC_GCSR2_GPID78_Pos))
#define PMC_GCSR2_GPID79_Pos                  _U_(15)                                              /**< (PMC_GCSR2) Generic Clock 79 Status Position */
#define PMC_GCSR2_GPID79_Msk                  (_U_(0x1) << PMC_GCSR2_GPID79_Pos)                   /**< (PMC_GCSR2) Generic Clock 79 Status Mask */
#define PMC_GCSR2_GPID79(value)               (PMC_GCSR2_GPID79_Msk & ((value) << PMC_GCSR2_GPID79_Pos))
#define PMC_GCSR2_GPID80_Pos                  _U_(16)                                              /**< (PMC_GCSR2) Generic Clock 80 Status Position */
#define PMC_GCSR2_GPID80_Msk                  (_U_(0x1) << PMC_GCSR2_GPID80_Pos)                   /**< (PMC_GCSR2) Generic Clock 80 Status Mask */
#define PMC_GCSR2_GPID80(value)               (PMC_GCSR2_GPID80_Msk & ((value) << PMC_GCSR2_GPID80_Pos))
#define PMC_GCSR2_GPID81_Pos                  _U_(17)                                              /**< (PMC_GCSR2) Generic Clock 81 Status Position */
#define PMC_GCSR2_GPID81_Msk                  (_U_(0x1) << PMC_GCSR2_GPID81_Pos)                   /**< (PMC_GCSR2) Generic Clock 81 Status Mask */
#define PMC_GCSR2_GPID81(value)               (PMC_GCSR2_GPID81_Msk & ((value) << PMC_GCSR2_GPID81_Pos))
#define PMC_GCSR2_GPID82_Pos                  _U_(18)                                              /**< (PMC_GCSR2) Generic Clock 82 Status Position */
#define PMC_GCSR2_GPID82_Msk                  (_U_(0x1) << PMC_GCSR2_GPID82_Pos)                   /**< (PMC_GCSR2) Generic Clock 82 Status Mask */
#define PMC_GCSR2_GPID82(value)               (PMC_GCSR2_GPID82_Msk & ((value) << PMC_GCSR2_GPID82_Pos))
#define PMC_GCSR2_GPID83_Pos                  _U_(19)                                              /**< (PMC_GCSR2) Generic Clock 83 Status Position */
#define PMC_GCSR2_GPID83_Msk                  (_U_(0x1) << PMC_GCSR2_GPID83_Pos)                   /**< (PMC_GCSR2) Generic Clock 83 Status Mask */
#define PMC_GCSR2_GPID83(value)               (PMC_GCSR2_GPID83_Msk & ((value) << PMC_GCSR2_GPID83_Pos))
#define PMC_GCSR2_GPID84_Pos                  _U_(20)                                              /**< (PMC_GCSR2) Generic Clock 84 Status Position */
#define PMC_GCSR2_GPID84_Msk                  (_U_(0x1) << PMC_GCSR2_GPID84_Pos)                   /**< (PMC_GCSR2) Generic Clock 84 Status Mask */
#define PMC_GCSR2_GPID84(value)               (PMC_GCSR2_GPID84_Msk & ((value) << PMC_GCSR2_GPID84_Pos))
#define PMC_GCSR2_GPID85_Pos                  _U_(21)                                              /**< (PMC_GCSR2) Generic Clock 85 Status Position */
#define PMC_GCSR2_GPID85_Msk                  (_U_(0x1) << PMC_GCSR2_GPID85_Pos)                   /**< (PMC_GCSR2) Generic Clock 85 Status Mask */
#define PMC_GCSR2_GPID85(value)               (PMC_GCSR2_GPID85_Msk & ((value) << PMC_GCSR2_GPID85_Pos))
#define PMC_GCSR2_GPID86_Pos                  _U_(22)                                              /**< (PMC_GCSR2) Generic Clock 86 Status Position */
#define PMC_GCSR2_GPID86_Msk                  (_U_(0x1) << PMC_GCSR2_GPID86_Pos)                   /**< (PMC_GCSR2) Generic Clock 86 Status Mask */
#define PMC_GCSR2_GPID86(value)               (PMC_GCSR2_GPID86_Msk & ((value) << PMC_GCSR2_GPID86_Pos))
#define PMC_GCSR2_GPID87_Pos                  _U_(23)                                              /**< (PMC_GCSR2) Generic Clock 87 Status Position */
#define PMC_GCSR2_GPID87_Msk                  (_U_(0x1) << PMC_GCSR2_GPID87_Pos)                   /**< (PMC_GCSR2) Generic Clock 87 Status Mask */
#define PMC_GCSR2_GPID87(value)               (PMC_GCSR2_GPID87_Msk & ((value) << PMC_GCSR2_GPID87_Pos))
#define PMC_GCSR2_GPID88_Pos                  _U_(24)                                              /**< (PMC_GCSR2) Generic Clock 88 Status Position */
#define PMC_GCSR2_GPID88_Msk                  (_U_(0x1) << PMC_GCSR2_GPID88_Pos)                   /**< (PMC_GCSR2) Generic Clock 88 Status Mask */
#define PMC_GCSR2_GPID88(value)               (PMC_GCSR2_GPID88_Msk & ((value) << PMC_GCSR2_GPID88_Pos))
#define PMC_GCSR2_GPID89_Pos                  _U_(25)                                              /**< (PMC_GCSR2) Generic Clock 89 Status Position */
#define PMC_GCSR2_GPID89_Msk                  (_U_(0x1) << PMC_GCSR2_GPID89_Pos)                   /**< (PMC_GCSR2) Generic Clock 89 Status Mask */
#define PMC_GCSR2_GPID89(value)               (PMC_GCSR2_GPID89_Msk & ((value) << PMC_GCSR2_GPID89_Pos))
#define PMC_GCSR2_GPID90_Pos                  _U_(26)                                              /**< (PMC_GCSR2) Generic Clock 90 Status Position */
#define PMC_GCSR2_GPID90_Msk                  (_U_(0x1) << PMC_GCSR2_GPID90_Pos)                   /**< (PMC_GCSR2) Generic Clock 90 Status Mask */
#define PMC_GCSR2_GPID90(value)               (PMC_GCSR2_GPID90_Msk & ((value) << PMC_GCSR2_GPID90_Pos))
#define PMC_GCSR2_GPID91_Pos                  _U_(27)                                              /**< (PMC_GCSR2) Generic Clock 91 Status Position */
#define PMC_GCSR2_GPID91_Msk                  (_U_(0x1) << PMC_GCSR2_GPID91_Pos)                   /**< (PMC_GCSR2) Generic Clock 91 Status Mask */
#define PMC_GCSR2_GPID91(value)               (PMC_GCSR2_GPID91_Msk & ((value) << PMC_GCSR2_GPID91_Pos))
#define PMC_GCSR2_GPID92_Pos                  _U_(28)                                              /**< (PMC_GCSR2) Generic Clock 92 Status Position */
#define PMC_GCSR2_GPID92_Msk                  (_U_(0x1) << PMC_GCSR2_GPID92_Pos)                   /**< (PMC_GCSR2) Generic Clock 92 Status Mask */
#define PMC_GCSR2_GPID92(value)               (PMC_GCSR2_GPID92_Msk & ((value) << PMC_GCSR2_GPID92_Pos))
#define PMC_GCSR2_GPID93_Pos                  _U_(29)                                              /**< (PMC_GCSR2) Generic Clock 93 Status Position */
#define PMC_GCSR2_GPID93_Msk                  (_U_(0x1) << PMC_GCSR2_GPID93_Pos)                   /**< (PMC_GCSR2) Generic Clock 93 Status Mask */
#define PMC_GCSR2_GPID93(value)               (PMC_GCSR2_GPID93_Msk & ((value) << PMC_GCSR2_GPID93_Pos))
#define PMC_GCSR2_GPID94_Pos                  _U_(30)                                              /**< (PMC_GCSR2) Generic Clock 94 Status Position */
#define PMC_GCSR2_GPID94_Msk                  (_U_(0x1) << PMC_GCSR2_GPID94_Pos)                   /**< (PMC_GCSR2) Generic Clock 94 Status Mask */
#define PMC_GCSR2_GPID94(value)               (PMC_GCSR2_GPID94_Msk & ((value) << PMC_GCSR2_GPID94_Pos))
#define PMC_GCSR2_GPID95_Pos                  _U_(31)                                              /**< (PMC_GCSR2) Generic Clock 95 Status Position */
#define PMC_GCSR2_GPID95_Msk                  (_U_(0x1) << PMC_GCSR2_GPID95_Pos)                   /**< (PMC_GCSR2) Generic Clock 95 Status Mask */
#define PMC_GCSR2_GPID95(value)               (PMC_GCSR2_GPID95_Msk & ((value) << PMC_GCSR2_GPID95_Pos))
#define PMC_GCSR2_Msk                         _U_(0xFFFFFFFF)                                      /**< (PMC_GCSR2) Register Mask  */

#define PMC_GCSR2_GPID_Pos                    _U_(0)                                               /**< (PMC_GCSR2 Position) Generic Clock 95 Status */
#define PMC_GCSR2_GPID_Msk                    (_U_(0xFFFFFFFF) << PMC_GCSR2_GPID_Pos)              /**< (PMC_GCSR2 Mask) GPID */
#define PMC_GCSR2_GPID(value)                 (PMC_GCSR2_GPID_Msk & ((value) << PMC_GCSR2_GPID_Pos)) 

