Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_GCSR3 : (PMC Offset: 0x19C) ( R/ 32) Generic Clock Status Register 3 -------- */
#define PMC_GCSR3_GPID96_Pos                  _U_(0)                                               /**< (PMC_GCSR3) Generic Clock 96 Status Position */
#define PMC_GCSR3_GPID96_Msk                  (_U_(0x1) << PMC_GCSR3_GPID96_Pos)                   /**< (PMC_GCSR3) Generic Clock 96 Status Mask */
#define PMC_GCSR3_GPID96(value)               (PMC_GCSR3_GPID96_Msk & ((value) << PMC_GCSR3_GPID96_Pos))
#define PMC_GCSR3_GPID97_Pos                  _U_(1)                                               /**< (PMC_GCSR3) Generic Clock 97 Status Position */
#define PMC_GCSR3_GPID97_Msk                  (_U_(0x1) << PMC_GCSR3_GPID97_Pos)                   /**< (PMC_GCSR3) Generic Clock 97 Status Mask */
#define PMC_GCSR3_GPID97(value)               (PMC_GCSR3_GPID97_Msk & ((value) << PMC_GCSR3_GPID97_Pos))
#define PMC_GCSR3_GPID98_Pos                  _U_(2)                                               /**< (PMC_GCSR3) Generic Clock 98 Status Position */
#define PMC_GCSR3_GPID98_Msk                  (_U_(0x1) << PMC_GCSR3_GPID98_Pos)                   /**< (PMC_GCSR3) Generic Clock 98 Status Mask */
#define PMC_GCSR3_GPID98(value)               (PMC_GCSR3_GPID98_Msk & ((value) << PMC_GCSR3_GPID98_Pos))
#define PMC_GCSR3_GPID99_Pos                  _U_(3)                                               /**< (PMC_GCSR3) Generic Clock 99 Status Position */
#define PMC_GCSR3_GPID99_Msk                  (_U_(0x1) << PMC_GCSR3_GPID99_Pos)                   /**< (PMC_GCSR3) Generic Clock 99 Status Mask */
#define PMC_GCSR3_GPID99(value)               (PMC_GCSR3_GPID99_Msk & ((value) << PMC_GCSR3_GPID99_Pos))
#define PMC_GCSR3_GPID100_Pos                 _U_(4)                                               /**< (PMC_GCSR3) Generic Clock 100 Status Position */
#define PMC_GCSR3_GPID100_Msk                 (_U_(0x1) << PMC_GCSR3_GPID100_Pos)                  /**< (PMC_GCSR3) Generic Clock 100 Status Mask */
#define PMC_GCSR3_GPID100(value)              (PMC_GCSR3_GPID100_Msk & ((value) << PMC_GCSR3_GPID100_Pos))
#define PMC_GCSR3_GPID101_Pos                 _U_(5)                                               /**< (PMC_GCSR3) Generic Clock 101 Status Position */
#define PMC_GCSR3_GPID101_Msk                 (_U_(0x1) << PMC_GCSR3_GPID101_Pos)                  /**< (PMC_GCSR3) Generic Clock 101 Status Mask */
#define PMC_GCSR3_GPID101(value)              (PMC_GCSR3_GPID101_Msk & ((value) << PMC_GCSR3_GPID101_Pos))
#define PMC_GCSR3_GPID102_Pos                 _U_(6)                                               /**< (PMC_GCSR3) Generic Clock 102 Status Position */
#define PMC_GCSR3_GPID102_Msk                 (_U_(0x1) << PMC_GCSR3_GPID102_Pos)                  /**< (PMC_GCSR3) Generic Clock 102 Status Mask */
#define PMC_GCSR3_GPID102(value)              (PMC_GCSR3_GPID102_Msk & ((value) << PMC_GCSR3_GPID102_Pos))
#define PMC_GCSR3_GPID103_Pos                 _U_(7)                                               /**< (PMC_GCSR3) Generic Clock 103 Status Position */
#define PMC_GCSR3_GPID103_Msk                 (_U_(0x1) << PMC_GCSR3_GPID103_Pos)                  /**< (PMC_GCSR3) Generic Clock 103 Status Mask */
#define PMC_GCSR3_GPID103(value)              (PMC_GCSR3_GPID103_Msk & ((value) << PMC_GCSR3_GPID103_Pos))
#define PMC_GCSR3_GPID104_Pos                 _U_(8)                                               /**< (PMC_GCSR3) Generic Clock 104 Status Position */
#define PMC_GCSR3_GPID104_Msk                 (_U_(0x1) << PMC_GCSR3_GPID104_Pos)                  /**< (PMC_GCSR3) Generic Clock 104 Status Mask */
#define PMC_GCSR3_GPID104(value)              (PMC_GCSR3_GPID104_Msk & ((value) << PMC_GCSR3_GPID104_Pos))
#define PMC_GCSR3_GPID105_Pos                 _U_(9)                                               /**< (PMC_GCSR3) Generic Clock 105 Status Position */
#define PMC_GCSR3_GPID105_Msk                 (_U_(0x1) << PMC_GCSR3_GPID105_Pos)                  /**< (PMC_GCSR3) Generic Clock 105 Status Mask */
#define PMC_GCSR3_GPID105(value)              (PMC_GCSR3_GPID105_Msk & ((value) << PMC_GCSR3_GPID105_Pos))
#define PMC_GCSR3_GPID106_Pos                 _U_(10)                                              /**< (PMC_GCSR3) Generic Clock 106 Status Position */
#define PMC_GCSR3_GPID106_Msk                 (_U_(0x1) << PMC_GCSR3_GPID106_Pos)                  /**< (PMC_GCSR3) Generic Clock 106 Status Mask */
#define PMC_GCSR3_GPID106(value)              (PMC_GCSR3_GPID106_Msk & ((value) << PMC_GCSR3_GPID106_Pos))
#define PMC_GCSR3_GPID107_Pos                 _U_(11)                                              /**< (PMC_GCSR3) Generic Clock 107 Status Position */
#define PMC_GCSR3_GPID107_Msk                 (_U_(0x1) << PMC_GCSR3_GPID107_Pos)                  /**< (PMC_GCSR3) Generic Clock 107 Status Mask */
#define PMC_GCSR3_GPID107(value)              (PMC_GCSR3_GPID107_Msk & ((value) << PMC_GCSR3_GPID107_Pos))
#define PMC_GCSR3_GPID108_Pos                 _U_(12)                                              /**< (PMC_GCSR3) Generic Clock 108 Status Position */
#define PMC_GCSR3_GPID108_Msk                 (_U_(0x1) << PMC_GCSR3_GPID108_Pos)                  /**< (PMC_GCSR3) Generic Clock 108 Status Mask */
#define PMC_GCSR3_GPID108(value)              (PMC_GCSR3_GPID108_Msk & ((value) << PMC_GCSR3_GPID108_Pos))
#define PMC_GCSR3_GPID109_Pos                 _U_(13)                                              /**< (PMC_GCSR3) Generic Clock 109 Status Position */
#define PMC_GCSR3_GPID109_Msk                 (_U_(0x1) << PMC_GCSR3_GPID109_Pos)                  /**< (PMC_GCSR3) Generic Clock 109 Status Mask */
#define PMC_GCSR3_GPID109(value)              (PMC_GCSR3_GPID109_Msk & ((value) << PMC_GCSR3_GPID109_Pos))
#define PMC_GCSR3_GPID110_Pos                 _U_(14)                                              /**< (PMC_GCSR3) Generic Clock 110 Status Position */
#define PMC_GCSR3_GPID110_Msk                 (_U_(0x1) << PMC_GCSR3_GPID110_Pos)                  /**< (PMC_GCSR3) Generic Clock 110 Status Mask */
#define PMC_GCSR3_GPID110(value)              (PMC_GCSR3_GPID110_Msk & ((value) << PMC_GCSR3_GPID110_Pos))
#define PMC_GCSR3_GPID111_Pos                 _U_(15)                                              /**< (PMC_GCSR3) Generic Clock 111 Status Position */
#define PMC_GCSR3_GPID111_Msk                 (_U_(0x1) << PMC_GCSR3_GPID111_Pos)                  /**< (PMC_GCSR3) Generic Clock 111 Status Mask */
#define PMC_GCSR3_GPID111(value)              (PMC_GCSR3_GPID111_Msk & ((value) << PMC_GCSR3_GPID111_Pos))
#define PMC_GCSR3_GPID112_Pos                 _U_(16)                                              /**< (PMC_GCSR3) Generic Clock 112 Status Position */
#define PMC_GCSR3_GPID112_Msk                 (_U_(0x1) << PMC_GCSR3_GPID112_Pos)                  /**< (PMC_GCSR3) Generic Clock 112 Status Mask */
#define PMC_GCSR3_GPID112(value)              (PMC_GCSR3_GPID112_Msk & ((value) << PMC_GCSR3_GPID112_Pos))
#define PMC_GCSR3_GPID113_Pos                 _U_(17)                                              /**< (PMC_GCSR3) Generic Clock 113 Status Position */
#define PMC_GCSR3_GPID113_Msk                 (_U_(0x1) << PMC_GCSR3_GPID113_Pos)                  /**< (PMC_GCSR3) Generic Clock 113 Status Mask */
#define PMC_GCSR3_GPID113(value)              (PMC_GCSR3_GPID113_Msk & ((value) << PMC_GCSR3_GPID113_Pos))
#define PMC_GCSR3_GPID114_Pos                 _U_(18)                                              /**< (PMC_GCSR3) Generic Clock 114 Status Position */
#define PMC_GCSR3_GPID114_Msk                 (_U_(0x1) << PMC_GCSR3_GPID114_Pos)                  /**< (PMC_GCSR3) Generic Clock 114 Status Mask */
#define PMC_GCSR3_GPID114(value)              (PMC_GCSR3_GPID114_Msk & ((value) << PMC_GCSR3_GPID114_Pos))
#define PMC_GCSR3_GPID115_Pos                 _U_(19)                                              /**< (PMC_GCSR3) Generic Clock 115 Status Position */
#define PMC_GCSR3_GPID115_Msk                 (_U_(0x1) << PMC_GCSR3_GPID115_Pos)                  /**< (PMC_GCSR3) Generic Clock 115 Status Mask */
#define PMC_GCSR3_GPID115(value)              (PMC_GCSR3_GPID115_Msk & ((value) << PMC_GCSR3_GPID115_Pos))
#define PMC_GCSR3_GPID116_Pos                 _U_(20)                                              /**< (PMC_GCSR3) Generic Clock 116 Status Position */
#define PMC_GCSR3_GPID116_Msk                 (_U_(0x1) << PMC_GCSR3_GPID116_Pos)                  /**< (PMC_GCSR3) Generic Clock 116 Status Mask */
#define PMC_GCSR3_GPID116(value)              (PMC_GCSR3_GPID116_Msk & ((value) << PMC_GCSR3_GPID116_Pos))
#define PMC_GCSR3_GPID117_Pos                 _U_(21)                                              /**< (PMC_GCSR3) Generic Clock 117 Status Position */
#define PMC_GCSR3_GPID117_Msk                 (_U_(0x1) << PMC_GCSR3_GPID117_Pos)                  /**< (PMC_GCSR3) Generic Clock 117 Status Mask */
#define PMC_GCSR3_GPID117(value)              (PMC_GCSR3_GPID117_Msk & ((value) << PMC_GCSR3_GPID117_Pos))
#define PMC_GCSR3_GPID118_Pos                 _U_(22)                                              /**< (PMC_GCSR3) Generic Clock 118 Status Position */
#define PMC_GCSR3_GPID118_Msk                 (_U_(0x1) << PMC_GCSR3_GPID118_Pos)                  /**< (PMC_GCSR3) Generic Clock 118 Status Mask */
#define PMC_GCSR3_GPID118(value)              (PMC_GCSR3_GPID118_Msk & ((value) << PMC_GCSR3_GPID118_Pos))
#define PMC_GCSR3_GPID119_Pos                 _U_(23)                                              /**< (PMC_GCSR3) Generic Clock 119 Status Position */
#define PMC_GCSR3_GPID119_Msk                 (_U_(0x1) << PMC_GCSR3_GPID119_Pos)                  /**< (PMC_GCSR3) Generic Clock 119 Status Mask */
#define PMC_GCSR3_GPID119(value)              (PMC_GCSR3_GPID119_Msk & ((value) << PMC_GCSR3_GPID119_Pos))
#define PMC_GCSR3_GPID120_Pos                 _U_(24)                                              /**< (PMC_GCSR3) Generic Clock 120 Status Position */
#define PMC_GCSR3_GPID120_Msk                 (_U_(0x1) << PMC_GCSR3_GPID120_Pos)                  /**< (PMC_GCSR3) Generic Clock 120 Status Mask */
#define PMC_GCSR3_GPID120(value)              (PMC_GCSR3_GPID120_Msk & ((value) << PMC_GCSR3_GPID120_Pos))
#define PMC_GCSR3_GPID122_Pos                 _U_(25)                                              /**< (PMC_GCSR3) Generic Clock 122 Status Position */
#define PMC_GCSR3_GPID122_Msk                 (_U_(0x3) << PMC_GCSR3_GPID122_Pos)                  /**< (PMC_GCSR3) Generic Clock 122 Status Mask */
#define PMC_GCSR3_GPID122(value)              (PMC_GCSR3_GPID122_Msk & ((value) << PMC_GCSR3_GPID122_Pos))
#define PMC_GCSR3_GPID123_Pos                 _U_(27)                                              /**< (PMC_GCSR3) Generic Clock 123 Status Position */
#define PMC_GCSR3_GPID123_Msk                 (_U_(0x1) << PMC_GCSR3_GPID123_Pos)                  /**< (PMC_GCSR3) Generic Clock 123 Status Mask */
#define PMC_GCSR3_GPID123(value)              (PMC_GCSR3_GPID123_Msk & ((value) << PMC_GCSR3_GPID123_Pos))
#define PMC_GCSR3_GPID124_Pos                 _U_(28)                                              /**< (PMC_GCSR3) Generic Clock 124 Status Position */
#define PMC_GCSR3_GPID124_Msk                 (_U_(0x1) << PMC_GCSR3_GPID124_Pos)                  /**< (PMC_GCSR3) Generic Clock 124 Status Mask */
#define PMC_GCSR3_GPID124(value)              (PMC_GCSR3_GPID124_Msk & ((value) << PMC_GCSR3_GPID124_Pos))
#define PMC_GCSR3_GPID125_Pos                 _U_(29)                                              /**< (PMC_GCSR3) Generic Clock 125 Status Position */
#define PMC_GCSR3_GPID125_Msk                 (_U_(0x1) << PMC_GCSR3_GPID125_Pos)                  /**< (PMC_GCSR3) Generic Clock 125 Status Mask */
#define PMC_GCSR3_GPID125(value)              (PMC_GCSR3_GPID125_Msk & ((value) << PMC_GCSR3_GPID125_Pos))
#define PMC_GCSR3_GPID126_Pos                 _U_(30)                                              /**< (PMC_GCSR3) Generic Clock 126 Status Position */
#define PMC_GCSR3_GPID126_Msk                 (_U_(0x1) << PMC_GCSR3_GPID126_Pos)                  /**< (PMC_GCSR3) Generic Clock 126 Status Mask */
#define PMC_GCSR3_GPID126(value)              (PMC_GCSR3_GPID126_Msk & ((value) << PMC_GCSR3_GPID126_Pos))
#define PMC_GCSR3_GPID127_Pos                 _U_(31)                                              /**< (PMC_GCSR3) Generic Clock 127 Status Position */
#define PMC_GCSR3_GPID127_Msk                 (_U_(0x1) << PMC_GCSR3_GPID127_Pos)                  /**< (PMC_GCSR3) Generic Clock 127 Status Mask */
#define PMC_GCSR3_GPID127(value)              (PMC_GCSR3_GPID127_Msk & ((value) << PMC_GCSR3_GPID127_Pos))
#define PMC_GCSR3_Msk                         _U_(0xFFFFFFFF)                                      /**< (PMC_GCSR3) Register Mask  */

#define PMC_GCSR3_GPID_Pos                    _U_(27)                                              /**< (PMC_GCSR3 Position) Generic Clock x27 Status */
#define PMC_GCSR3_GPID_Msk                    (_U_(0x1F) << PMC_GCSR3_GPID_Pos)                    /**< (PMC_GCSR3 Mask) GPID */
#define PMC_GCSR3_GPID(value)                 (PMC_GCSR3_GPID_Msk & ((value) << PMC_GCSR3_GPID_Pos)) 

