Microchip-MPLAB-Harmony/motor_control/apps/pmsm_foc_encoder_lx7720_sam_rh71_ek/firmware/src/packs/ATSAMRH71F20C_DFP/component/pmc.h
/* -------- PMC_OSC2 : (PMC Offset: 0x1B0) (R/W 32) Oscillator Control Register 2 -------- */
#define PMC_OSC2_EN_Pos                       _U_(0)                                               /**< (PMC_OSC2) Enable Position */
#define PMC_OSC2_EN_Msk                       (_U_(0x1) << PMC_OSC2_EN_Pos)                        /**< (PMC_OSC2) Enable Mask */
#define PMC_OSC2_EN(value)                    (PMC_OSC2_EN_Msk & ((value) << PMC_OSC2_EN_Pos))    
#define PMC_OSC2_OSCRCF_Pos                   _U_(4)                                               /**< (PMC_OSC2) 2nd Oscillator Frequency Selection Position */
#define PMC_OSC2_OSCRCF_Msk                   (_U_(0x3) << PMC_OSC2_OSCRCF_Pos)                    /**< (PMC_OSC2) 2nd Oscillator Frequency Selection Mask */
#define PMC_OSC2_OSCRCF(value)                (PMC_OSC2_OSCRCF_Msk & ((value) << PMC_OSC2_OSCRCF_Pos))
#define   PMC_OSC2_OSCRCF_4_MHZ_Val           _U_(0x0)                                             /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 4 MHZ  */
#define   PMC_OSC2_OSCRCF_8_MHZ_Val           _U_(0x1)                                             /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 8 MHZ  */
#define   PMC_OSC2_OSCRCF_10_MHZ_Val          _U_(0x2)                                             /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 10 MHZ  */
#define   PMC_OSC2_OSCRCF_12_MHZ_Val          _U_(0x3)                                             /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 12 MHZ  */
#define PMC_OSC2_OSCRCF_4_MHZ                 (PMC_OSC2_OSCRCF_4_MHZ_Val << PMC_OSC2_OSCRCF_Pos)   /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 4 MHZ Position  */
#define PMC_OSC2_OSCRCF_8_MHZ                 (PMC_OSC2_OSCRCF_8_MHZ_Val << PMC_OSC2_OSCRCF_Pos)   /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 8 MHZ Position  */
#define PMC_OSC2_OSCRCF_10_MHZ                (PMC_OSC2_OSCRCF_10_MHZ_Val << PMC_OSC2_OSCRCF_Pos)  /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 10 MHZ Position  */
#define PMC_OSC2_OSCRCF_12_MHZ                (PMC_OSC2_OSCRCF_12_MHZ_Val << PMC_OSC2_OSCRCF_Pos)  /**< (PMC_OSC2) The 2nd RC oscillator frequency is at 12 MHZ Position  */
#define PMC_OSC2_EN_WR_CALIB_Pos              _U_(8)                                               /**< (PMC_OSC2) Enable Calibration Register Write Position */
#define PMC_OSC2_EN_WR_CALIB_Msk              (_U_(0x1) << PMC_OSC2_EN_WR_CALIB_Pos)               /**< (PMC_OSC2) Enable Calibration Register Write Mask */
#define PMC_OSC2_EN_WR_CALIB(value)           (PMC_OSC2_EN_WR_CALIB_Msk & ((value) << PMC_OSC2_EN_WR_CALIB_Pos))
#define PMC_OSC2_KEY_Pos                      _U_(16)                                              /**< (PMC_OSC2) Register Write Access Password Position */
#define PMC_OSC2_KEY_Msk                      (_U_(0xFF) << PMC_OSC2_KEY_Pos)                      /**< (PMC_OSC2) Register Write Access Password Mask */
#define PMC_OSC2_KEY(value)                   (PMC_OSC2_KEY_Msk & ((value) << PMC_OSC2_KEY_Pos))  
#define   PMC_OSC2_KEY_PASSWD_Val             _U_(0x37)                                            /**< (PMC_OSC2) Writing any other value in this field aborts the write operation.Always reads as 0.  */
#define PMC_OSC2_KEY_PASSWD                   (PMC_OSC2_KEY_PASSWD_Val << PMC_OSC2_KEY_Pos)        /**< (PMC_OSC2) Writing any other value in this field aborts the write operation.Always reads as 0. Position  */
#define PMC_OSC2_Msk                          _U_(0x00FF0131)                                      /**< (PMC_OSC2) Register Mask  */


/* -------- PMC_OCR2 : (PMC Offset: 0x1B4) (R/W 32) Oscillator Calibration Register 2 -------- */
#define PMC_OCR2_CAL4_Pos                     _U_(0)                                               /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR2_CAL4_Msk                     (_U_(0x7F) << PMC_OCR2_CAL4_Pos)                     /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR2_CAL4(value)                  (PMC_OCR2_CAL4_Msk & ((value) << PMC_OCR2_CAL4_Pos))
#define PMC_OCR2_SEL4_Pos                     _U_(7)                                               /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 4 MHz Position */
#define PMC_OCR2_SEL4_Msk                     (_U_(0x1) << PMC_OCR2_SEL4_Pos)                      /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 4 MHz Mask */
#define PMC_OCR2_SEL4(value)                  (PMC_OCR2_SEL4_Msk & ((value) << PMC_OCR2_SEL4_Pos))
#define PMC_OCR2_CAL8_Pos                     _U_(8)                                               /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR2_CAL8_Msk                     (_U_(0x7F) << PMC_OCR2_CAL8_Pos)                     /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR2_CAL8(value)                  (PMC_OCR2_CAL8_Msk & ((value) << PMC_OCR2_CAL8_Pos))
#define PMC_OCR2_SEL8_Pos                     _U_(15)                                              /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 8 MHz Position */
#define PMC_OCR2_SEL8_Msk                     (_U_(0x1) << PMC_OCR2_SEL8_Pos)                      /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 8 MHz Mask */
#define PMC_OCR2_SEL8(value)                  (PMC_OCR2_SEL8_Msk & ((value) << PMC_OCR2_SEL8_Pos))
#define PMC_OCR2_CAL10_Pos                    _U_(16)                                              /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 10 MHz Position */
#define PMC_OCR2_CAL10_Msk                    (_U_(0x7F) << PMC_OCR2_CAL10_Pos)                    /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 10 MHz Mask */
#define PMC_OCR2_CAL10(value)                 (PMC_OCR2_CAL10_Msk & ((value) << PMC_OCR2_CAL10_Pos))
#define PMC_OCR2_SEL10_Pos                    _U_(23)                                              /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 10 MHz Position */
#define PMC_OCR2_SEL10_Msk                    (_U_(0x1) << PMC_OCR2_SEL10_Pos)                     /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 10 MHz Mask */
#define PMC_OCR2_SEL10(value)                 (PMC_OCR2_SEL10_Msk & ((value) << PMC_OCR2_SEL10_Pos))
#define PMC_OCR2_CAL12_Pos                    _U_(24)                                              /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR2_CAL12_Msk                    (_U_(0x7F) << PMC_OCR2_CAL12_Pos)                    /**< (PMC_OCR2) Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR2_CAL12(value)                 (PMC_OCR2_CAL12_Msk & ((value) << PMC_OCR2_CAL12_Pos))
#define PMC_OCR2_SEL12_Pos                    _U_(31)                                              /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 12 MHz Position */
#define PMC_OCR2_SEL12_Msk                    (_U_(0x1) << PMC_OCR2_SEL12_Pos)                     /**< (PMC_OCR2) Selection of Main RC Oscillator Calibration Bits for 12 MHz Mask */
#define PMC_OCR2_SEL12(value)                 (PMC_OCR2_SEL12_Msk & ((value) << PMC_OCR2_SEL12_Pos))
#define PMC_OCR2_Msk                          _U_(0xFFFFFFFF)                                      /**< (PMC_OCR2) Register Mask  */


/** \brief PMC register offsets definitions */
#define PMC_SCER_REG_OFST              (0x00)              /**< (PMC_SCER) System Clock Enable Register Offset */
#define PMC_SCDR_REG_OFST              (0x04)              /**< (PMC_SCDR) System Clock Disable Register Offset */
#define PMC_SCSR_REG_OFST              (0x08)              /**< (PMC_SCSR) System Clock Status Register Offset */
#define CKGR_MOR_REG_OFST              (0x20)              /**< (CKGR_MOR) Main Oscillator Register Offset */
#define CKGR_MCFR_REG_OFST             (0x24)              /**< (CKGR_MCFR) Main Clock Frequency Register Offset */
#define CKGR_PLLAR_REG_OFST            (0x28)              /**< (CKGR_PLLAR) PLLA Register Offset */
#define CKGR_PLLBR_REG_OFST            (0x2C)              /**< (CKGR_PLLBR) PLLB Register Offset */
#define PMC_MCKR_REG_OFST              (0x30)              /**< (PMC_MCKR) Master Clock Register Offset */
#define PMC_PCK_REG_OFST               (0x40)              /**< (PMC_PCK) Programmable Clock Register Offset */
#define PMC_IER_REG_OFST               (0x60)              /**< (PMC_IER) Interrupt Enable Register Offset */
#define PMC_IDR_REG_OFST               (0x64)              /**< (PMC_IDR) Interrupt Disable Register Offset */
#define PMC_SR_REG_OFST                (0x68)              /**< (PMC_SR) Status Register Offset */
#define PMC_IMR_REG_OFST               (0x6C)              /**< (PMC_IMR) Interrupt Mask Register Offset */
#define PMC_FOCR_REG_OFST              (0x78)              /**< (PMC_FOCR) Fault Output Clear Register Offset */
#define PMC_PLL_CFG_REG_OFST           (0x80)              /**< (PMC_PLL_CFG) PLL Configuration Register Offset */
#define PMC_WPMR_REG_OFST              (0xE4)              /**< (PMC_WPMR) Write Protection Mode Register Offset */
#define PMC_WPSR_REG_OFST              (0xE8)              /**< (PMC_WPSR) Write Protection Status Register Offset */
#define PMC_PCR_REG_OFST               (0x10C)             /**< (PMC_PCR) Peripheral Control Register Offset */
#define PMC_OCR1_REG_OFST              (0x110)             /**< (PMC_OCR1) Oscillator Calibration Register Offset */
#define PMC_PMMR_REG_OFST              (0x130)             /**< (PMC_PMMR) PLL Maximum Multiplier Value Register Offset */
#define PMC_CPULIM_REG_OFST            (0x160)             /**< (PMC_CPULIM) CPU Monitor Limits Register Offset */
#define PMC_CSR0_REG_OFST              (0x170)             /**< (PMC_CSR0) Peripheral Clock Status Register 0 Offset */
#define PMC_CSR1_REG_OFST              (0x174)             /**< (PMC_CSR1) Peripheral Clock Status Register 1 Offset */
#define PMC_CSR2_REG_OFST              (0x178)             /**< (PMC_CSR2) Peripheral Clock Status Register 2 Offset */
#define PMC_CSR3_REG_OFST              (0x17C)             /**< (PMC_CSR3) Peripheral Clock Status Register 3 Offset */
#define PMC_GCSR0_REG_OFST             (0x190)             /**< (PMC_GCSR0) Generic Clock Status Register 0 Offset */
#define PMC_GCSR1_REG_OFST             (0x194)             /**< (PMC_GCSR1) Generic Clock Status Register 1 Offset */
#define PMC_GCSR2_REG_OFST             (0x198)             /**< (PMC_GCSR2) Generic Clock Status Register 2 Offset */
#define PMC_GCSR3_REG_OFST             (0x19C)             /**< (PMC_GCSR3) Generic Clock Status Register 3 Offset */
#define PMC_OSC2_REG_OFST              (0x1B0)             /**< (PMC_OSC2) Oscillator Control Register 2 Offset */
#define PMC_OCR2_REG_OFST              (0x1B4)             /**< (PMC_OCR2) Oscillator Calibration Register 2 Offset */

